[
{"Link": "https://unica.vn/toan-tap-ngon-ngu-lap-trinh-c", "Name": "unica", "Title": "Toàn tập ngôn ngữ lập trình C#", "GV": "Trần Duy Thanh", "Gioithieu": "Ngôn ngữ lập trình C# Hiện nay ngôn ngữ lập trình C# là một trong những ngôn ngữ được rất nhiều người sử dụng trong công việc lập trình của mình. Bởi đây là một trong những ngôn ngữ có cấu trúc rõ ràng, dễ hiểu và dễ học. Ngôn ngữ lập trình C# thừa hưởng những ưu việt từ ngôn ngữ lập trình Java, C và C++ cũng như có khả năng khắc phục được những điểm hạn chế của những ngôn ngữ trên, điều này đã tạo nên một ngôn ngữ C# với tính ưu việt gần như hoàn hảo nhất. Và nếu bạn là người đang đi tìm cho mình một lộ trình học ngôn ngữ lập trình C# một cách bài bản, tối ưu chi phí và linh động thời gian học nhất thì bạn không nên bỏ qua khóa học \"Toàn tập ngôn ngữ lập trình C#\" của giảng viên đào tạo Trần Duy Thanh. Khóa học lập trình C# được xem là cuốn cẩm nang cần thiết dành cho những ai đang có nhu cầu học ngôn ngữ C#, từ những khái niệm cơ bản đến các bài học lập trình C # cụ thể có tính ứng dụng cao. Khóa học sẽ trình bày các kiến thức về C#, đây là ngôn ngữ lập trình hướng đối tượng được phát triển bởi Microsoft, được xây dựng dựa trên C++ và Java. Còn chần chờ gì nữa mà không đăng ký ngay khóa học\"Toàn tập ngôn ngữ lập trình C#\" của giảng viên đào tạo Trần Duy Thanh."},
{"Link": "https://unica.vn/xay-dung-website-responsive-voi-html5-css3", "Name": "unica", "Title": "Xây dựng Website Responsive với HTML5, CSS3", "GV": "Bùi Quang Trung", "Gioithieu": "Responsive là gì ? ❌ Responsive là một công nghệ dùng cho ngành thiết kế website, sử dụng để website phù hợp trên tất cả các kích thước màn hình từ một cơ sở dữ liệu và một layout gốc.  ❌ Trước đây người thiết kế phải thiết kế 2 bản riêng biệt một cho màn hình máy tính và một cho màn hình thiết bị di động. Sự ra đời của Responsive là giải pháp tuyệt vời của vấn đề này, vẫn chỉ một bản thiết kế, người dùng có thể truy cập trên các thiết bị kích thước khác nhau với cùng địa chỉ URL, giao diện hiển thị vẫn giữ nguyên. ❌ Bắt đầu từ năm 2015 công nghệ thiết kế website responsive đã trở thành xu hướng, được áp dụng phổ biến và nhận được nhiều phản hồi tích cực từ khách hàng sử dụng, giúp người đọc có thể dùng và tìm kiếm dễ dàng trên website. ❌ Responsive hiện nay đang là một trong những môn học siêu HOT trong các khóa học công nghệ thông tin được dân lân trình săn đón tìm hiểu Hiểu được điều đó, chúng tôi hợp tác cùng giảng viên có nhiều năm kinh nghiệm trong lĩnh vực lập trình Bùi Quang Trung mang đến cho bạn khóa học \"Xây dựng Website Responsive với HTML5, CSS3\" Nội dung khóa học  ✔️ Khóa học bao gồm 14 chương với 76 bài giảng.  ✔️ Ở 8 chương đầu học viên sẽ được cung cấp kiến thức từ cơ bản đến nâng cao về xây dựng website responsive sử dụng HTML5 và CSS3.  ✔️ Với 4 chương còn lại học viên sẽ cùng thầy thực hiện các project thực hành trực tiếp sử dụng các kiến thức đã được học để cho ra một sản phẩm demo hoàn chỉnh. ✔️ Thời lượng khóa học kéo dài hơn 12 giờ đồng hồ với kiến thức tổng hợp, đặc biệt có nhiều kỹ năng và kinh nghiệm kèm theo các bài tập thực hành lấy những ví dụ thực tế nhất, giúp bạn có thể áp dụng ngay kiến thức đã học để làm website cho riêng mình. ✔️ Bất kể mục đích lập trình của bạn là gì ( kiếm tiền, nâng cao kiến thức, master trong lập trình website ...), khóa học này đều có thể đáp ứng được cho bạn. Còn vô vàn những điều hấp dẫn khác có trong các khóa học lập trình web online, nhanh tay đăng ký khóa học Xây dựng Website Responsive với HTML5, CSS3 để có cơ hội sở hữu ngay hôm nay bạn nhé ! Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày"},
{"Link": "https://unica.vn/lap-trinh-restful-webservice-trong-6-tuan", "Name": "unica", "Title": "Lập trình Restful Webservice trong 6 tuần", "GV": "Trần Duy Thanh", "Gioithieu": "Lập trình Restful Webservice là gì? Restful Web service là các web Service được viết dựa trên kiến trúc REST. REST đã được sử dụng rộng rãi thay thế cho các Web Service dựa trên SOAP và WSDL. Lập trình Restful Webservice là gì nhẹ, dễ dàng mở rộng và bảo trì đơn giản. REST định nghĩa các quy tắc kiến trúc để bạn thiết kế Web services, chú trọng vào tài nguyên hệ thống, bao gồm các trạng thái tài nguyên được định dạng như thế nào và được truyền tải qua HTTP, và được viết bởi nhiều ngôn ngữ khác nhau. Nhưng: Để học lập trình web Restful Web service này không phải đơn giản. Chính vì thế, khóa học Lập trình Restful Webservice trong 6 tuần của giảng viên Trần Duy Thanh sẽ cung cấp trọn bộ kiến thức lập trình Web service để bạn nắm rõ cách thức cài đặt cấu hình IIS Webserver. Khóa học bao gồm 53 bài giảng và thời lượng học là 16 giờ 48 phút. Khóa học cung cấp trọn bộ kiến thức lập trình Webservice với Web API Restful, học viên có thể dễ dàng tương tác từ Di động Android, Desktop (Winform, Java Swing), JavaScript, AngularJS tới Webservice, có thể khai thác được Microsoft SQL Server cũng như Visual Studio hiệu quả và xin việc làm Backend cho Di động Khóa họ̣c còn sử dụng những công cụ Framework mới nhất, tìm hiểu ngôn ngữ lập trình C#, LINQ to SQL, cung cấp những kiến thức lập trình .net Webservice,cung cấp cách thức cài đặt cấu hình IIS Webserver, cách thức cài đặt Webservice, cách thức tương tác dữ liệu từ Di động Android, Desktop (Winform, Java swing), JavaScript, AngularJS tới .net Webservicce Tham gia khóa học \"Lập trình Restful Webservice trong 6 tuần\" ngay hôm nay. Ngoài ra còn rất nhiều điều bất ngờ trong các khóa học công nghệ thông tin trên UNICA về giá và có toàn bộ kiến thức về lập trình Restful đang chờ bạn khám phá đấy!"},
{"Link": "https://unica.vn/lap-trinh-android-tu-co-ban-den-thanh-thao", "Name": "unica", "Title": "Lập trình Android từ cơ bản đến thành thạo", "GV": "Vũ Quốc Tuấn", "Gioithieu": "Hệ điều hành Android hiện nay đang là hệ điều hành số một thế giới chiếm tới hơn 85% thị phần di động toàn cầu. Đây là hệ điều hành có mã nguồn do chính Google phát hành, do đó cho đến nay chúng đã cho phép các nhà phát triển, lập trình viên điều chỉnh và phân phối Android một cách tự do nhất. Với thị trường khát nhân lực như hiện nay, nghề lập trình viên Android đã tạo ra vô vàn cơ hội rộng lớn cho các bạn trẻ, nhất là đối với những bạn yêu thích học công nghệ thông tin, lập trình và yêu thích công việc phân tích và phát triển hệ điều hành Android. Nhận thấy những nhu cầu đó, giảng viên Vũ Quốc Tuấn kết hợp cùng Unica xuất bản khóa học “Lập trình Android từ cơ bản đến thành thạo” giúp học viên có thể trang bị được những kiến thức liên quan đến Android để có thể tự vận hàng các ứng dụng trên Appstore một cách nhanh chóng.  Với lộ trình 103 bài giảng, khóa học lập trình android online này là tổng hợp kiến thức nền tảng nhất để bạn hiểu đúng về bản chất ngôn ngữ lập trình Java, từ đó ứng dụng thực tế với hệ điều hành Android. Cụ thể, nội dung chương trình học sẽ bao gồm các phần học chính như sau: Tổng quan lập trình Java, Quy trình thiết kế ứng dụng Android trên Android Studio, Xử lý các đối tượng cơ bản trong Android, Chạy quảng cáo Admob và Publish ứng dụng, Thực hành tự xây dựng ứng dụng trên Clone Mp3.Zing.Vn và Webservice - Xây dựng cửa hàng bán quần áo.  Với mỗi phần học chính, ngoài những kiến thức lý thuyết, có tới 80% liên quan đến ví dụ và thực hành với mục đích tập trung đào tạo kỹ năng lập trình cho học viên, giúp học viên học lập trình Android để ứng dụng làm việc chứ không đơn thuần chỉ là lý thuyết suông, sáo rỗng. Mục tiêu chính của khóa học là trao kiến thức và các kỹ năng lập trình cơ bản nhất để học viên không bị ngỡ ngàng khi làm quen với loại ngôn ngữ lập trình này. Từ đó, giúp học viên có thể tự mình tạo ra thu nhập nhờ những dự án do chính tay bạn làm ra sau khi kết thúc khóa học lập trình Android này. Nếu bạn đang là người mới bắt đầu tìm hiểu về lập trình hoặc muốn bắt đầu từ một ngôn ngữ lập trình liên quan đến Android để định hình nền móng sự phát triển trong tương lai cho bản thân cũng như ngành công nghệ thông tin thì khóa học này sẽ là một sự lựa chọn vô cùng hoàn hảo. Khóa học phù hợp với các đối tượng học viên là: - Học sinh đã tốt nghiệp THPT muốn định hướng về nghề lập trình viên trong tương lai và có đam mê về công nghệ thông tin. - Sinh viên khóa công nghệ thông tin các trường trung cấp, cao đẳng, đại học trên phạm vi cả nước. - Nhân viên, lập trình viên các công ty muốn nâng cao tay nghề.  Điểm đặc biệt của khóa học lập trình Android là kiến thức bám sát thực tiễn giúp học viên có thể thoải mái phát triển ý tưởng khác nhau và thực hiện nó. Với ưu đãi mua một lần sở hữu trọn đời, bạn có thể học và thực hành bất cứ khi nào mình muốn mà không có sự giới hạn về thời gian và số lần học cho đến khi thành thạo các ngôn ngữ lập trình mà giảng viên đã cung cấp trong khóa học.  Vậy còn chần chừ gì mà không tham gia khóa học \"Lập trình Android từ cơ bản đến thành thạo\" ngay hôm nay để nhanh chóng làm chủ được Java và sớm trở thành một chuyên viên lập trình ứng dụng Android tài năng nhất!"},
{"Link": "https://unica.vn/lam-5-du-an-website-de-tro-thanh-lap-trinh-vien-chuyen-nghiep", "Name": "unica", "Title": "Làm 5 dự án website để trở thành lập trình viên chuyên nghiệp", "GV": "Võ Đức Thiện", "Gioithieu": "Bạn có biết rằng,  ❌ Trên thế giới hiện tại có hơn 4 tỷ trang web, mỗi ngày có hơn 1000 website mới ra đời và có xu hướng ngày càng tăng khi mà mọi lĩnh vực, mọi thành phần, ngành nghề, cá nhân hay tổ chức đều có nhu cầu xây dựng website cho riêng mình. Để có thể làm được 1 website đẹp, chuyên nghiệp cần có kiến thức về lập trình nói riêng và kỹ năng về công nghệ thông tin nói chung.  ❌ Hiện tại có rất nhiều khóa học công nghệ thông tin đào tạo lập trình website với cách đào tạo truyền thống (giảng viên truyền đạt toàn bộ kiến thức nền tảng, sau đó học viên tự ứng dụng vào trong thực tế).  Tuy nhiên không phải học viên nào cũng có thể hiểu được hết tất cả các lý thuyết nền tảng và kỹ năng của 1 ngôn ngữ lập trình;  khi bắt tay vào xây dựng 1 dự án thực tế thì học viên sẽ không biết bắt đầu từ đâu và sẽ làm như thế nào, dẫn đến học viên rất hay nản khi học lập trình.  >> Từ thực trạng trên, khóa học \"Làm 5 dự án website để trở thành lập trình viên chuyên nghiệp\" sẽ tiếp cận theo hướng dạy học theo tình huống, giảng viên sẽ hướng dẫn từ cơ bản đến chuyên sâu (step by step) cách để làm 5 dự án startup về website liên quan đến 5 kỹ năng mà người lập trình viên phải có bao gồm: Dự án 1: kỹ năng cắt HTML/CSS từ file PSD Dự án 2: kỹ năng lập trình responsive & hiệu ứng 3D của CSS3 Dự án 3: kỹ năng lập trình JQuery, drag and drop & animation trên web Dự án 4: kỹ năng về thiết kế CSDL MySQL và lập trình PHP theo mô hình MVC Dự án 5: kỹ năng về sử dụng framework trong lập trình PHP để xây dựng ứng dụng web Lợi ích khóa học ✔️ Trong video bài giảng để làm 5 dự án startup này thì giảng viên có lồng ghép kiến thức lý thuyết nền tảng kết hợp với hướng dẫn kỹ năng từng bước rõ ràng để giúp học viên học và làm theo được sản phẩm đề ra.  ✔️ Sau khi tự tay làm ra được sản phẩm, học viên sẽ thích thú và tự hiểu được kiến thức, lý thuyết lập trình theo cách của mình. Từ đó tạo ra động lực và niềm đam mê giúp học viên sẽ tiến xa hơn trong lĩnh vực lập trình. >> Vậy còn chần chừ gì mà không nhanh tay đăng ký tham gia khóa học Làm 5 dự án website để trở thành lập trình viên chuyên nghiệp có tại Unica.vn để có cơ hội nhận những ưu đãi bất ngờ ngay hôm nay bạn nhé !"},
{"Link": "https://unica.vn/tu-che-tao-may-bay-dieu-khien-tu-xa-rc", "Name": "unica", "Title": "Tự chế tạo máy bay điều khiển từ xa RC", "GV": "Nguyễn Thế Phương", "Gioithieu": "Bạn đọc thân mến, Với sự phát triển của động cơ điện 3 pha siêu nam châm không chổi than, điều khiển thông minh và vật liệu xốp nhẹ giúp chúng ta chế tạo và điều khiển các loại máy bay dễ dàng hơn với các dụng cụ vật liệu dễ tìm! Và nếu bạn là một người đam mê chế tạo, nhất là chế tạo máy bay điều khiển từ xa thì khóa học này chính là DÀNH CHO BẠN: khóa học trực tuyến \"Tự chế tạo máy bay điều khiển từ xa RC\" do giảng viên Nguyễn Thế Phương trực tiếp hướng dẫn. Khóa học sẽ giúp bạn:      ✔️ Được cung cấp đầy đủ kiến thức và kỹ năng cơ bản để tự chế tạo một chiếc máy cánh bằng điều khiển từ xa hoàn chỉnh      ✔️ Hướng dẫn chi tiết, bài bản và khoa học phù hợp với các bạn chưa biết, chưa hiểu về nguyên lý hoạt động      ✔️ Cung cấp kiến thức về khí động lực học, các thuật ngữ điều khiển máy bay,...       ✔️ Các loại vật liệu chế tạo để chế tạo thành công một chiếc máy bay điều khiển từ xa.      ✔️ Hướng dẫn cơ bản về đọc hiểu bản vẽ, sử dụng các dụng cụ dao cắt đúng kỹ thuật, cắt xốp dán với nhau để hoàn chỉnh một chiếc vỏ máy bay hoàn thiện.      ✔️ Kiến thức cơ bản về linh kiện chức năng và nhiệm vụ của linh kiện, chi tiết lắp ráp các linh kiện lên máy bay sao cho chính xác, cân bằng.      ✔️ Hướng dẫn bay mô phỏng trên máy tính giúp các bạn làm quen khi bay ngoài trời giảm thiểu tổn thất khi bay thực tế ngoài trời, các kỹ thuật thao tác chuẩn bị khi bay ngoài trời.      ✔️ Nâng cao khả năng để thiết kế tàu không gian, tên lửa, chế tạo robot bay không người lái UAV, robot vận chuyển hàng, máy bay phun thuốc sâu, máy bay cảnh báo sớm cháy rừng thiên tai, kéo cáp điện trên không Không chỉ có vậy khóa học này còn bổ sung cho bạn kiến thức cơ bản về cách đọc bản vẽ cách cắt ghép xốp mô hình và căn chỉnh lắp đặt động cơ cách điều khiển máy bay mô hình, những kiến thức cơ bản của máy bay giúp bạn có thể chế tạo nhiều loại máy bay khác nhau mà bạn thích, sớm chinh phục được bầu trời với đam mê chế tạo máy bay! Mọi kiến thức, kỹ năng trong bài học đều sẽ là trang bị kiến thức cơ bản giúp bạn làm nền tảng để học nâng cao thêm những khóa học công nghệ thông tin khác. Nội dung khóa học được thiết kế vô cùng đơn giản nhưng chi tiết, bài bản, sử dụng các từ thông dụng của mô hình thế giới giải thích chi tiết để tất cả các bạn dễ dùng, dễ hiểu, nhanh chóng thực hành và chế tạo được máy bay thực tế ngoài trời! Còn chờ đợi gì nữa, tham gia khóa học \"Tự chế tạo máy bay điều khiển từ xa RC\" ngay hôm nay thôi!"},
{"Link": "https://unica.vn/lap-trinh-linq-toan-tap", "Name": "unica", "Title": "Lập trình LinQ toàn tập", "GV": "Trần Duy Thanh", "Gioithieu": "Có phải bạn đang... Bạn là học sinh, sinh viên muốn định hướng nghề nghiệp theo học công nghệ thông tin? Bạn muốn học lập trình C# hiệu quả tại nhà để ứng dụng trong việc học hành? Bạn đang tốn quá nhiều thời gian cho việc học lập trình web mà vẫn chưa thấy tính ứng dụng của nó? Bạn cần một lộ trình học ngôn ngữ C# bài bản, chi tiết và đầy đủ tổng hợp đầy đủ kiến thức và những kỹ thuật nâng cao? Hay bạn đã học ngôn ngữ lập trình C#, đã đi làm nhưng lại đang gặp khó khăn trong việc thao tác xử lý, chuỗi mảng, thiết kế giao diện trong quá trình lập trình, và bạn đang cần một khóa học để trau dồi bổ sung thêm những kiến thức về C#? Hãy tham gia khóa học \"Lập trình LinQ toàn tập\" của giảng viên Trần Duy Thanh tại Unica! Khóa học \"Lập trình LinQ toàn tập\" sẽ cung cấp trọn bộ kiến thức từ cơ bản đến nâng cao của lập trình C# , học viên có thể tạo ra một ứng dụng C# hoàn chỉnh sau khi hoàn thành khóa học Khóa học có điều gì đặc biệt bạn không nên bỏ qua?       ✔️ Cung cấp những cơ hội thực hành tạo ứng dụng C# ngay trong quá trình học       ✔️ Sau khi hoàn thành khóa học, có thể xin việc vào các công ty sử dụng công nghệ .Net       ✔️ Làm chủ LinQ: Linq to object, Linq to SQL       ✔️ Khóa họ̣c sử dụng những công cụ, Framework mới nhất.       ✔️ Sử dụng Extension method       ✔️ Các kiến thức về lập trình hướng đối tượng trong C#       ✔️ Xử lý chuỗi, mảng, collections       ✔️ Sử dụng thuần thục các control khi thiết kế giao diện       ✔️ Khả năng gỡ lỗi và kiểm soát biệt lệ       ✔️ Kết nối và tương tác cơ sở dữ liệu với Micrsoft SQL Server       ✔️ Triển khai được mô hình đa tầng       ✔️ Đóng gói được ứng dụng để xuất bản cho khách hàng Đừng bỏ lỡ cơ hội sở hữu khóa học lập trình hấp dẫn \"Lập trình LinQ toàn tập\" tại Unica để nhanh chóng làm chủ được ngôn ngữ C# và ứng dụng thành công trong công việc của bạn ngay hôm nay! "},
{"Link": "https://unica.vn/hoc-jquery-tu-co-ban-den-nang-cao", "Name": "unica", "Title": "Học jQuery từ cơ bản đến nâng cao", "GV": "Nguyễn Đức Việt", "Gioithieu": "Bạn có biết: Với sự phát triển nhanh chóng của Internet, người dùng ngày càng quan tâm hơn đến giao diện hay hình thức của một trang web. Nếu như trước đây, quy chuẩn đẹp của một trang web là chỉ cần có banner, nội dung và một ít footer đơn giản. Nhưng theo thời gian, thị hiếu người đọc cũng thay đổi, một trang web phải có banner bắt mắt, nội dung lôi cuốn kèm theo các hiệu ứng lạ mắt mới có thể thu hút được người đọc dài lâu.  Chính vì vậy, các web developers, web designers cần thiết phải nâng cao tay nghề. Và một trong những công cụ cần thiết đến từ các thư viện JavaScript mở được quan tâm nhiều nhất đó chính là jQuery, công cụ giúp tạo ra các hiệu ứng có thể tương tác trực tiếp với người đọc một cách nhanh chóng và dễ dàng hơn so với việc sử dụng thuần JavaScript. Bạn muốn tìm hiểu và vận dụng những tính năng tối ưu của jQuery nhưng không biết bắt đầu từ đâu và thế nào? Khóa học jQuery cơ bản đến nâng cao của giảng viên Nguyễn Đức Việt trên UNICA ra đời giúp các bạn có thể chỉnh sửa giao diện của một website bất kỳ; tăng khả năng tương tác với người dùng; tạo hiệu ứng động cho nội dung; có khả năng tự đọc hiểu các tài liệu tự lập trình jQuery trong suốt khóa học jQuery online này. Vì sao nên đăng ký khóa học jQuery cơ bản đến nâng cao Với 5 năm kinh nghiệm giảng dạy, bằng cách học qua trải nghiệm, các hướng dẫn tự làm, và qua các bài tập thực hành tập trung vào nâng cao chuyên môn để mang đến các khóa học công nghệ thông tin chất lượng nhất, Giảng viên Nguyễn Đức Việt sẽ giúp bạn: ✔️ Sử dụng thành thạo jQuery sau khóa học này. ✔️ Có thể làm lại được hầu hết các hiệu ứng gặp được trên mạng. ✔️ Có khả năng lập trình và quản trị hiệu ứng cho các trang Web phục vụ nhu cầu giải trí, kinh doanh, khởi nghiệp. ✔️ Đọc và hiểu các thuật ngữ về jQuery một cách thuần thục. ✔️ Các kĩ thuật check lỗi, tìm và sửa lỗi lập trình jQuery. Hãy nhanh tay đăng ký khóa học Học jQuery từ cơ bản đến nâng cao trên UNICA để nhận nhiều ưu đãi bất ngờ từ giá! Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày"},
{"Link": "https://unica.vn/lap-trinh-wordpress-theme-cho-doanh-nghiep-cung-bootstrap", "Name": "unica", "Title": "Lập trình Wordpress Theme cho doanh nghiệp cùng Bootstrap", "GV": "Lê Anh Tuấn", "Gioithieu": "Theme WordPress là gì? Hiểu một cách đơn giản, theme là giao diện của WordPress. Đối với website làm bằng wordpress thì theme là thư mực có chứa toàn bộ file thiết kế. Đây là nơi Wordpress cho phép bạn thay đổi, chỉnh sửa giao diện, mỗi trang web có một  theme riêng biệt. Ưu điểm của việc dùng Theme WordPress đó là: ✔️ Cài đặt đơn giản chỉ cần vài thao tác là hoàn thành. ✔️ Dễ phát triển, chỉnh sửa và bảo trì. ✔️ Giao diện quản lý đơn giản và dễ hiểu. ✔️ Cấu trúc rõ ràng. ✔️ Thân thiện với các công cụ tìm kiếm. Chính vì những ưu điểm đó, chúng tôi muốn giới thiệu đến các bạn khóa học Lập trình Wordpress Theme cho doanh nghiệp cùng Bootstrap của giảng viên Lê Anh Tuấn trên UNICA. Khóa học mang đến cho bạn một theme Wordpress trưng bày sản phẩm bán. Nội dung khóa học Khoá học Lập trình Wordpress Theme cho doanh nghiệp cùng Bootstrap sẽ mang đến cho bạn các thông tin cần thiết về học công nghệ thông tin để bạn tự sáng tạo một theme WordPress với chức năng Portfolio để trưng bày gian hàng, sản phẩm hay đơn giản là các hình ảnh của doanh nghiệp hay cá nhân. Bạn sẽ được học lập trình web online sử dụng framework như Bootstrap kết hợp với Underscores based theme để sáng tạo ra những theme WordPress cho riêng công việc của bạn nhanh chóng, tiết kiệm thời gian, mobile responsive, hiển thị tốt trên mọi kích cỡ màn hình. Bạn sẽ tự tạo cho mình một theme phù hợp cho công việc, mang cá tính, phong cách riêng của mình mà không phải sử dụng những theme đại trà có nhiều thứ rườm rà cho người mới sử dụng, không cần thiết cho bạn, hay doanh nghiệp của bạn, bạn hiểu nó và hoàn toàn quản lý nó dễ dàng, tiết kiệm thời gian và những rắc rối của sự phụ thuộc. Bạn sẽ có một nền tảng cơ bản để bạn tiếp tục học hỏi sáng tạo để bạn đi xa hơn trong công việc thiết kế web nói chung và học Wordpress.           Hãy nhanh tay đăng ký khóa học Lập trình Wordpress Theme cho doanh nghiệp cùng Bootstrap cùng UNICA ngay hôm nay! Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày  "},
{"Link": "https://unica.vn/che-tao-robot-do-duong", "Name": "unica", "Title": "Chế tạo Robot dò đường", "GV": "Phan Hoàng Anh", "Gioithieu": "Có phải,  ❌ Bạn là người hâm mộ chương trình Robocon bởi đội tuyển Việt Nam đã vô địch 5 lần? ❌ Bạn yêu thích các loại robot thông minh từ Mỹ, Nhật Bản? ❌ Bạn mong muốn tự tay chế tạo robot thông minh và mang lại lợi ích thực tiễn? Tham khảo khóa học Chế tạo Robot dò đường có tại Unica.vn >> Khóa học được biên soạn bởi giảng viên Phan Hoàng Anh- Chuyên gia đào tạo Robotics tại Việt Nam.  Tại sao gọi là ROBOT DÒ ĐƯỜNG? - Với những lắp ráp đơn giản và thêm chút hướng dẫn về nguyên lý hoạt động và áp dụng bộ cảm biến, bạn sẽ có ngay 1 chú robot thông minh biết nhận biết màu sắc và đi theo màu sắc đó. Lợi ích khóa học ✔️ Với khóa học này, ngay cả khi bạn chưa biết chút gì về máy móc hay các linh kiện điện tử, thậm chí là nguyên lý hoạt động vật lý thì bạn cũng có thể tự tay chế tạo Robot. ✔️ Robot dò đường là một mẫu robot kinh điển dành người mới nhập môn trong robotics. Việc học về Robot dò đường giúp người học có những kiến thức cơ bản nhất cho việc học lập trình và chế tạo trong điều khiển và tự động hóa ✔️ Sau khi kết thúc khóa học Chế tạo Robot dò đường các bạn học sinh - sinh viên có thể tự học, tự nghiên cứu và tìm tòi công nghệ, giải các bài toán trong robotics liên quan đến vạch dò đường cùng những kiến thức nền tảng về sử dụng cảm biến. Và có kiến thức nền tảng cơ bản làm đòn bẩy vững chắc giúp bạn nâng cao kiên thức trong các khóa học công nghệ thông tin khác. ✔️ Thêm một điểm thú vị nữa của khóa học là bạn sẽ có cơ hội được khám phá ý tưởng “Trâu gỗ ngựa máy” của Gia Cát Lượng năm xưa.  Vậy còn chần chừ gì nữa mà không nhanh tay đăng ký tham gia khóa học Chế tạo Robot dò đường có tại Unica.vn để có cơ hội sở hữu ngay hôm nay bạn nhé !"},
{"Link": "https://unica.vn/lap-trinh-web-voi-nodejs", "Name": "unica", "Title": "Lập trình Web tốc độ cao, thời gian thực với NodeJS", "GV": "Bá Ngọc Cương", "Gioithieu": "Bạn có biết: Node.js là 1 nền tảng phát triển ứng dụng phía server. Nó sử dụng ngôn ngữ lập trình JavaScript. Mỗi kết nối đến sẽ sinh ra 1 sự kiện, cho phép hàng chục nghìn user truy cập cùng lúc và tốc độ thì cực nhanh.  NodeJS hiện đang là 1 Javascript Engine cực hot, được nhiều người ưa chuộng bởi tốc độ nhanh, nhẹ, đơn giản và thư viện hỗ trợ phong phú.  Tuy nhiên: ❓ Bạn đang gặp phải thắc mắc về việc tự học công nghệ thông tin và tự theo đuổi con đường lập trình. Bạn nhận thấy việc tự học không có thầy rất khó. ❓ Bạn không biết NodeJS làm việc như thế nào, không biết cách tạo một webservice cơ bản ❓ Bạn đang vật lộn trong việc xây dựng và thiết kế cơ sở dữ liệu ❓ Bạn đang xây dựng trang quản trị CSM cho blog, xây dựng API xóa bài viết nhưng vẫn loay hoay chưa biết cách xử lý như nào? ❓ Bạn không có một lộ trình học lập trình web online bài bản và đầy đủ. Tất cả những vấn đề trên đều được giải quyết trong 6 giờ 10 phút với khóa học “Lập trình Web tốc độ cao, thời gian thực với NodeJS” của giảng viên Bá Ngọc Cương trên UNICA để được hướng dẫn bạn từng bước để xây dựng các ứng dụng Web thời gian thực, tốc độ cao: BLOG cá nhân, CHAT nhóm,.. Khóa học học Nodejs online bao gồm 52 bài giảng và được chia làm 9 nội dung học cụ thể như sau: - Phần 1: Giới thiệu và cài đặt môi trường - Phần 2: Làm việc với NodeJS - Phần 3: Làm việc với ExpressJS Framework -  Phần 4: Cài đặt và kết nối CSDL MySQL - Phần 5: Xây dựng module Đăng Ký và Đăng nhập -  Phần 6: Xây dựng trang quản trị CMS cho BLOG -  Phần 7: Xây dựng BLOG cá nhân - Phần 8: Xây dựng ứng dụng CHAT thời gian thực với NodeJS và Socket.IO -  Phần 9: Triển khai ứng dụng NodeJS trên Server Vậy còn chần chờ gì nữa mà không  đăng ký ngay khóa học Nodejs \"Lập trình Web tốc độ cao, thời gian thực với NodeJS\"  ngay hôm nay để Update xu thế!   Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày"},
{"Link": "https://unica.vn/docker-co-ban", "Name": "unica", "Title": "Docker cơ bản", "GV": "Trần Anh Đức", "Gioithieu": "Docker đang được rất nhiều người tò mò và gây chú ý trong cộng đồng trên thế giới và hứa hẹn rất nhiều điều tốt đẹp trong tương lai. Kể đến những cái tên đình đám như Google, Amazon, Microsoft, IBM… đã bắt đầu hỗ trợ Docker trên nền tảng của mình. Bởi vậy mà trong các khoá học CNTT, từ khoá \"Docker\" luôn sở hữu lượng tìm kiếm lớn. Docker là một nền tảng mở dành cho bạn đang theo học ngôn ngữ lập trình, quản trị hệ thống dùng để xây dựng, vận chuyển và chạy các ứng dụng phân tán. Docker là một nền tảng cho phép Developers và Sysadmin để develop, deploy và run Application với container. Nó cho phép người dùng tạo ra một môi trường độc lập và tách biệt để khởi chạy và phát triển. Tuy nhiên, để sử dụng được Docker không hề đơn giản và dễ dàng. Nếu như bạn chỉ học lý thuyết và không có người hướng dẫn thực hành thì chắc chắn sẽ không theo kịp được lĩnh vực này. Chính vì thế, khóa học Docker cơ bản của giảng viên Trần Anh Đức trên UNICA sẽ hướng dẫn bạn các thao tác làm việc với Docker đơn giản nhất có thể. Bạn sẽ được hướng dẫn cài đặt môi trường, chạy ứng dụng đầu tiên trên nền Docker, cơ chế, cách quản lý và tạo lập Docker image... Phương pháp giảng dạy tập trung chủ yếu vào việc thực hành qua các bài tập và ví dụ, giúp bạn được trang bị nhiều kinh nghiệm học docker thực tiễn. Lợi ích của việc học Docker ✔️ Docker bật và tắt chỉ trong vài giây giúp bạn tiết kiệm thời gian. ✔️ Có thể khởi chạy được container trên mỗi hệ thống mình muốn. ✔️ Dễ dàng được thiết lập trong môi trường làm việc. ✔️ Giúp cho workspace của bạn sạch sẽ hơn khi xóa môi trường mà không ảnh hưởng đến các phần khác. Với những lý do liệt kê ở trên, còn chần chừ gì mà bạn không nhanh tay đăng ký ngay khóa học Docker cơ bản."},
{"Link": "https://unica.vn/hacker-mu-trang-aeh", "Name": "unica", "Title": "Hacker Mũ Trắng AEH", "GV": "Trung Tâm ATHENA", "Gioithieu": "Bảo mật mạng đã trở thành một yếu tố vô cùng quan trọng đối với các tổ chức cũng như trong các hoạt động kinh doanh. Hàng ngày có rất nhiều vụ tấn công, ăn cắp dữ liệu. Rất nhiều server, website tung lên mạng nhưng không được bảo vệ. Việc để lộ thông tin, ăn cắp dữ liệu đã gây thiệt hại lớn cho doanh nghiệp. Chính vì thế cách phòng thủ tốt nhất chính là tấn công vào hệ thống của mình. Chính vì vậy khóa học Hacker Mũ Trắng AEH đã ra đời để giúp bạn bảo vệ chính website, thông tin mạng của chính mình. Nội dung khóa học Hacker Mũ Trắng AEH  Khóa Học Hacker Mũ Trắng AEH đến từ Trung tâm ATHENA sẽ cung cấp cho học viên các kỹ thuật tấn công, kiểm tra an ninh mạng cho hệ thống công nghệ thông tin.  Học viên sẽ được thực hành thu thập thông tin hệ thống, xác định các lỗi hệ điều hành và ứng dụng đang được cài đặt trong hệ thống. Khóa học này được xây dựng dành riêng cho những chuyên viên phụ trách an ninh mạng, các nhân viên kiểm toán, chuyên gia bảo mật, quản trị website và cho tất cả những ai có công việc liên quan đến cơ sở hạ tầng mạng. Sinh viên quản trị mạng tại các ngân hàng, doanh nghiệp, cơ quan nhà nước. Sinh viên học công nghệ thông tin tại các trường đại học, cao đẳng. Những ai đam mê tìm hiểu công nghệ, mong muốn trở thành chuyên gia bảo mật chuyên nghiệp. Bạn sẽ tìm hiểu được kỹ năng tấn công và phòng thủ hack website, server, email, SMS,... Thông qua việc học hack và xác định được nguyên nhân cách thức của kẻ tấn công dữ liệu hệ thống, giúp bạn khai thác hệ thống mạng và gia cố bảo mật. Ngoài ra bạn còn được trang bị kỹ năng kiểm tra rà soát lỗi an ninh mạng cho máy tính cá nhân và hệ thống mạng cho doanh nghiệp. Những kiến thức mang tính thực hành chuyên sâu để bạn có thể bảo vệ hệ thống mạng của mình một cách tốt nhất. Với nhiều lợi ích như vậy, bạn hãy nhanh tay đăng ký khoá học Hacker Mũ Trắng AEH tại Unica.vn ngay hôm nay!"},
{"Link": "https://unica.vn/lap-trinh-reactjs-toan-tap", "Name": "unica", "Title": "Lập trình ReactJS toàn tập", "GV": "Đinh Nguyễn Trọng Nghĩa", "Gioithieu": "Khóa học Lập trình ReactJS toàn tập là một khóa học trực tuyến về lập trình ứng dụng web bằng ReactJS - một thư viện JavaScript phổ biến được sử dụng để phát triển các ứng dụng web động và tương tác. Trong khóa học này, các bạn sẽ được học về ReactJS - một trong những framework phát triển ứng dụng web phổ biến nhất hiện nay. Khóa học sẽ cung cấp cho các bạn kiến thức và kỹ năng cần thiết để phát triển các ứng dụng web động và tương tác bằng ReactJS, cùng với những kiến thức về các công cụ và kỹ thuật phát triển ứng dụng web. Khóa học này bao gồm các chủ đề chính sau: Tổng quan về ReactJS và cách sử dụng nó để phát triển ứng dụng web Các khái niệm cơ bản như components, props, state và lifecycle methods Cách xử lý sự kiện và tương tác người dùng với ứng dụng Cách thực hiện các kỹ thuật tiên tiến như routing, redux Cách sử dụng các thư viện và công cụ hữu ích để giúp tăng hiệu quả phát triển Khóa học này được thiết kế cho những người muốn học lập trình ReactJS từ cơ bản đến nâng cao và có thể được sử dụng bởi các lập trình viên mới bắt đầu hoặc các chuyên gia muốn nâng cao kỹ năng của mình. Bạn sẽ có cơ hội học từ các chuyên gia trong lĩnh vực và sử dụng những kỹ thuật phổ biến và hiệu quả trong việc phát triển ứng dụng web bằng ReactJS."},
{"Link": "https://unica.vn/tu-thiet-ke-website-cho-moi-linh-vuc-ma-khong-can-biet-lap-trinh", "Name": "unica", "Title": "Tự thiết kế website cho mọi lĩnh vực mà không cần biết lập trình", "GV": "Hải Trần", "Gioithieu": "Bạn thân mến, Hiện nay hầu hết khi nhắc đến website thì ai cũng biết, nhưng hầu hết nghĩ rằng để làm được website thì thật là khó. Khóa học này sẽ giúp bạn nhận thấy việc thiết kế một website chẳng có gì là cao siêu cả. Trong bất kỳ lĩnh vực kinh doanh nào cũng phải cần đến website. Khách hàng có thể xem và tìm hiểu cơ sở kinh doanh của bạn qua website. Họ sẽ đến với sản phẩm, dịch vụ của bạn thông qua website. Để có thể thiết kế một website thì không khó, nhưng chi phí để thuê một đơn vị dịch vụ này thiết kế thì khá cao. Và đặc biệt trong quá trình sử dụng muốn thay đổi hay cập nhật thông tin trên web thì rất phiền và mất thời gian. Chính vì điều này mà làm chậm trễ đi nhiều kế hoạch kinh doanh của bạn. Khóa học “Tự thiết kế website mọi lĩnh vực không cần biết lập trinh” sẽ giúp cho học viên giải quyết những vấn đề về: - Không tốn chi phí thuê đơn vị bên ngoài thiết kế website khi bạn đang ở giai đoạn khởi nghiệp ban đầu. - Có thể tự quản lý và sử dụng website của mình một cách hiệu quả trong kinh doanh. - Có thể tự lên thiết kế website cho mọi lĩnh vực dành cho ai muốn theo đuổi công việc thiết kế website mà không cần phải hiểu bất cứ ngôn ngữ lập trình nào. - Biết cách truyển tải những nội dung phù hợp lên website để giúp khách hàng hiểu rõ hơn về sản phẩm, dịch vụ của mình. - Có thể quản trị website và giúp các bài viết về sản phẩm, dịch vụ của bạn xuất hiện trên TOP trên google. - Tạo cơ hội tìm kiếm một công việc cố định liên quan đến thiết kế hay quản trị website nếu bạn đang là sinh viên hoặc chưa có nghề nào khác. - Bạn muốn một công việc tự do về thời gian để đi du lịch đây đó mà vẫn có thể tạo ra được thu nhập cố định bằng nghề thiết kế website. - Có thể tự tay tạo các Blog cá nhân để xây dựng thương hiệu cá nhân hiệu quả. Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày"},
{"Link": "https://unica.vn/hoc-cat-web-tu-file-thiet-ke", "Name": "unica", "Title": "Học HTML5/CSS3, BOOTSTRAP 4 và học cắt Web từ file thiết kế", "GV": "Nguyễn Đức Việt", "Gioithieu": "Có phải bạn:  Bạn bắt đầu làm quen và biết đến cắt web, thiết kế website? Bạn yêu thích những công việc đầy sáng tạo, ý tưởng mới lạ cắt, thiết kế web? Công việc của bạn đòi hỏi bạn cần biết bắt web, xử lý thông tin, trình bày các nội dung trên web? Bạn cần học công nghệ thông tin online để trang bị thêm những kiến thức cơ bản nhất về cắt, thiết kế web để phục vụ cho công việc của mình, cũng như có thêm cơ hội thăng tiến, kiếm thêm thu nhập cho bản thân? Bạn mới chỉ biết về cắt, thiết kế web chứ không thành thạo và biết các công cụ sử dụng trong cắt web? Bạn đang tìm kiếm một khóa học lập trình web phù hợp với mình Tất cả những khó khăn đó của bạn sẽ được giải quyết nhanh chóng, ngay lập tức khi bạn tham gia khóa. Khóa học BOOTSTRAP 4, HTML5/CSS3 sẽ giúp bạn cải thiện và nâng cao ngay lập tức trình độ cắt web, sử dụng công cụ tác nghiệp trên website. Đặc biệt, đây là khóa học dành cho những người mới bắt đầu, cơ bản từ con số 0 về thiết kế website. Giảng viên Nguyễn Đức Việt sẽ cùng với Học viên Online Unica.vn mang đến cho các bạn một khóa học “Học HTML5/CSS3, BOOTSTRAP 4 và học cắt Web từ file thiết kế” với 13 phần giúp các học viên biến những kỹ năng cắt web trở nên đơn giản vô cùng. Khóa học cung cấp cho học viên đầy đủ những kỹ năng cắt web từ cơ bản đến nâng cao. Trong quá trình học, học viên cũng được thực hành cắt web cụ thể trên các trang báo như: VnExpress, Dantri, Kenh14, Baomoi, Vietnamnet.vn,... Các bạn sẽ được rèn luyện thành thục tất cả các kỹ năng cắt web được sử dụng nhiều nhất hiện nay, sử dụng Bootstrap 4 - công cụ lập trình HTML Front End mới nhất đang được nhiều đơn vị web lựa chọn.  Cùng rất nhiều những tính năng cắt web tối ưu, đảm bảo sản phẩm đẹp các sử dụng font icon và làm các hiệu ứng hover trực tiếp trên web,... Trình độ cắt web của bạn sẽ được “nâng cấp” khiến bạn không khỏi bất ngờ. Bạn không chỉ thỏa mãn được đam mê của mình, thỏa sức sáng tạo với các hiệu ứng và kĩ năng cắt web, mà còn mở thêm nhiều cơ hội để thăng tiến trong công việc và thể hiện trình độ chuyên môn của mình. Vậy còn chờ đợi gì nữa, đăng ký khóa học “Học HTML5/CSS3, BOOTSTRAP 4 và học cắt Web từ file thiết kế” của giảng viên Nguyễn Đức Việt ngay hôm nay trước khi hết chương trình ưu đãi khóa học tại Unica thôi! Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày"},
{"Link": "https://unica.vn/su-dung-windows-10-thanh-thao-cho-cong-viec-trong-2h", "Name": "unica", "Title": "Sử dụng Windows 10 thành thạo cho công việc trong 2h", "GV": "Nguyễn Khánh Tùng", "Gioithieu": "Khóa học hướng dẫn cho người học biết cách sử dụng thành thạo hệ điều hành windows 10, từ cơ bản đến nâng cao, phục vụ tốt nhất cho công việc và học tập. Khám phá giao diện và những tính năng cơ bản trên Windows 10. Cách kết nối mạng và sử dụng tài nguyên mạng trên Windows 10. Cách tùy biến Windows 10 theo sở thích của mỗi cá nhân. Thành thạo tính năng quản lý file, sao lưu dữ liệu, bố trí các màn hình làm việc hợp lý Khóa học này không có lý thuyết, chỉ có hướng dẫn thực hành ngay trên Windows 10, do vậy có tính thực tế cao."},
{"Link": "https://unica.vn/huong-dan-phat-trien-san-pham-iot-tu-phong-lab-den-thuong-mai", "Name": "unica", "Title": "Hướng dẫn phát triển sản phẩm IoT từ phòng Lab đến thương mại", "GV": "Nguyễn Khánh Tùng", "Gioithieu": "- Cung cấp cho người học công nghệ thông tin khái niệm, mô hình, phương pháp và kỹ năng để xây dựng các sản phẩm IoT có thể ứng dụng trong gia đình (smarthome), điện lực, nông nghiệp, y tế, nhà máy sản xuất. - Học xong biết làm một sản phẩm IoT, từ đó người học có thể tự định nghĩa khái niệm IoT là gì theo chính kinh nghiệm bản thân, và mở ra nhiều ý tưởng sáng chế về sản phẩm IoT phục vụ cho cuộc sống. - Kiến thức chung về hệ thống IoT là gì, ứng dụng trong những lĩnh vực gì của xã hội - Kiến trúc một hệ thống IoT, đặc điểm một sản phẩm IoT. - Mô phỏng hoạt động hệ thống IoT trên phần mềm - Các loại cảm biến - Phương pháp xây dựng sản phẩm IoT cụ thể từ A-Z, có thể thương mại hóa Phương pháp học hiện đại: đi từ khái niệm ->Hướng dẫn mô phỏng trên phần mềm-->Hướng dẫn lắp đặt & Thử nghiệm sản phẩm trong phòng Lab--> Hướng dẫn triển khai thực tế và Đánh giá hiệu quả sản phẩm. "},
{"Link": "https://unica.vn/lap-trinh-winform-voi-c-10-ung-dung", "Name": "unica", "Title": "Lập trình WinForm với C#: 10 ứng dụng", "GV": "Trần Duy Thanh", "Gioithieu": "Nếu bạn là: Học sinh / sinh viên đang theo học công nghệ thông tin muốn tìm hiểu chuyên sâu về ngôn ngữ lập trình C# để tìm việc làm thêm hay tăng cơ hội nghề nghiệp sau khi ra trường Lập trình viên: Muốn tiếp cận học ngôn ngữ lập trình mới để nâng cao khả năng của mình, mở rộng cơ hội thăng tiến và thu nhập? Và bất cứ ai: Yêu thích và có đam mê phát triển sự nghiệp trong lĩnh vực lập trình, đã biết một ít hoặc chưa hề biết gì về lập trình? Vậy bạn không nên bỏ lỡ khóa học \"Lập trình WinForm với C#: 10 ứng dụng\" của giảng viên Trần Duy Thanh. Khóa học winform c# này với lộ trình học bài bản nhất, đầy đủ và chi tiết nhất dành cho tất cả mọi người yêu thích và đam mê lập trình Khóa học Lập trình WinForm với C# 10 ứng dụng cung cấp trọn bộ kiến thức nâng cao của lập trình C# , học viên có thể tạo ra một ứng dụng C# hoàn chỉnh sau khi hoàn thành khóa học Khóa học cung cấp những cơ hội thực hành tạo ứng dụng C# ngay trong quá trình học. Sau khi hoàn thành khóa học, học viên sẽ có thể:       ✔️ Khóa họ̣c sử dụng những công cụ, Framework mới nhất.      ✔️ Các kiến thức về lập trình hướng đối tượng trong C#      ✔️ Xử lý chuỗi, mảng, collections      ✔️ Sử dụng thuần thục các control khi thiết kế giao diện      ✔️ Khả năng gỡ lỗi và kiểm soát biệt lệ      ✔️ Kết nối và tương tác cơ sở dữ liệu với Micrsoft SQL Server      ✔️ Triển khai được mô hình đa tầng      ✔️ Đóng gói được ứng dụng để xuất bản cho khách hàngc      ✔️ Có thể xin việc vào các công ty sử dụng công nghệ .Net Nội dung khóa học cụ thể:      Phần 1: Lập trình Windows Form nâng cao trong C#      Phần 2: Xử lý tập tin trong C#      Phần 3: Lập trình cơ sở dữ liệu trong C#      Phần 4: Kiến trúc đa tầng trong C#      Phần 5: Giới thiệu một số Third party Component      Phần 6: Đóng gói ứng dụng      Phần 7: Bài tập rèn luyện tổng hợp- có đáp án      Phần 8: Bài tập rèn luyện tổng hợp- tự giải Còn chần chờ gì nữa nhanh tay đăng ký ngay khóa học\"Lập trình WinForm với C#: 10 ứng dụng\"của giảng viên Trần Duy Thanh nhé!"},
{"Link": "https://unica.vn/lam-chu-canva-com-co-ban-va-nang-cao", "Name": "unica", "Title": "Làm chủ phần mềm xử lý ảnh, video Canva.com cơ bản và nâng cao", "GV": "Nguyễn Thành Thơ", "Gioithieu": "Bên cạnh kỹ năng văn phòng như soạn thảo văn bản, sử dụng bảng tính, kết nối Internet… thì kỹ năng về đồ họa, biên tập và dựng video rất quan trọng vì các kỹ năng này sẽ giúp bạn truyền tải nội dung một cách sinh động nhất, nâng cao khả năng tiếp thu thông tin và phản hồi của người nhận, giúp bạn gia tăng hiệu suất công việc (bán hàng, marketing, truyền thông, giảng dạy, xây dựng thương hiệu cá nhân…) Canva.com sở hữu một kho dữ liệu khổng lồ với hàng ngàn template (mẫu thiết kế) đẹp mắt, hàng triệu nguyên liệu (ảnh, video, âm thanh) được bổ sung thường xuyên giúp rút ngắn tối đa thời gian thực hiện một sản phẩm đồ họa, video nhưng vẫn đảm bảo chất lượng, chuyên nghiệp và sáng tạo, phục vụ tốt cho các thiết kế thông dụng như poster, logo, banner, thiệp chúc mừng sinh nhật, thiệp cưới, card visit, bản thuyết trình… thậm chí là cả CV hay Inforgraphic, vẽ biểu đồ. Khóa học Làm chủ Canva.com cơ bản và nâng cao sẽ giúp bạn làm chủ kỹ năng thiết kế, góp phần mang lại hiệu quả tối đa cho công việc và cuộc sống của bạn.  Khi hoàn thành khoá học Canva bạn sẽ biết được những cách thiết kế, các thông số, biết cách chỉnh sửa theo mẫu caova, những quy tắc trong quá trình học thiết kế Canva."},
{"Link": "https://unica.vn/che-tao-canh-tay-robot-dieu-khien-bang-may-tinh", "Name": "unica", "Title": "Chế tạo cánh tay robot điều khiển bằng máy tính", "GV": "Phan Hoàng Anh", "Gioithieu": "Bạn có biết rằng,  Cánh tay robot (Robot arm) là sản phẩm chiếm thị phần cao nhất trong lĩnh vực robot công nghiệp, với vai trò đắc lực trong các dây chuyền sản xuất. Tham gia khóa học chế tạo cánh tay Robot điều khiển bằng máy tính có tại Unica.vn ✔️ Khóa học được biên soạn bởi giảng viên Phan Hoàng Anh. Thầy là chuyên gia đào tạo Robotics tại Việt Nam. ✔️ Khóa học là một trải nghiệm học tập thú vị quy trình chế tạo và lập trình cho một cánh tay robot ở 3 chế độ: Tự động, điều khiển và bán tự động Nội dung khóa học - Giáo trình có 61 bài giảng bao gồm 8 nội dung chính ✔️ Tổng quan về linh kiện và cách ghép nối ✔️ Điều khiển động cơ servo ✔️ Điều khiển động cơ servo bằng nút bấm và biến trở ✔️ Các hàm điều khiển cơ bản ✔️ Gửi tín hiệu Serial từ máy tính ✔️ Lập trình Visual C# điều khiển tay robot ✔️ Chế độ tự động ✔️ Điều khiển không dây Khóa học sẽ chia sẻ với bạn về Công nghệ truyền tín hiệu điều khiển bằng máy tính Lập trình cánh tay robot tự động với động cơ servo Điều khiển cánh tay robot với nút bấm và biến trở Khả năng điều khiển một cánh tay vô tri vô giác với quyền năng của một nhà sáng chế Ý tưởng và kiến thức cơ bản để tham gia các giải khoa học công nghệ trong, ngoài nước và học chuyên sâu thêm các khoá học công nghệ thông tin online khác Và còn nhiều hơn thế nữa ..... Với ưu đãi mua một lần sở hữu trọn đời. Vậy còn chần chừ gì mà không nhanh tay đăng ký khóa học Chế tạo cánh tay robot điều khiển bằng máy tính ngay hôm nay bạn nhé !"},
{"Link": "https://unica.vn/lap-trinh-voi-scratch-3-0", "Name": "unica", "Title": "Lập trình với Scratch 3.0 nâng cao", "GV": "Học viện VIETSTEM", "Gioithieu": "KHÓA HỌC LẬP TRÌNH SCRATCH 3.0 NÂNG CAO Giúp học sinh từ 8 - 16 tuổi tìm hiểu chuyên sâu hơn về bộ môn Lập trình thông qua việc tạo ra các chương trình trên máy tính bằng ngôn ngữ lập trình kéo thả Scratch theo các cấp độ từ dễ đến khó. Nội dung chính của khóa học:  Nội dung khóa học được xây dựng dựa trên một phần cuốn giáo trình \"Lập trình với Scratch 3.0\" xuất bản tại NXB Đại học Quốc Gia Hà Nội do Học Viện VIETSTEM biên soạn. Đồng thời bổ sung thêm các chương trình phần mềm hỗ trợ học tập một số môn học như môn Toán, Lý, Lịch sử. Khóa học bao gồm 05 chương: Chương 1: Thiết kế và Lập trình sản phẩm Thiệp sinh nhật. Chương 2: Thiết kế và Lập trình mô phỏng hoạt động của Đồng hồ Chương 3: Thiết kế và Lập trình mô phỏng mạch điện Chương 4: Thiết kế và Lập trình trò chơi Điện Biên Phủ trên không Chương 5: Thiết kế và Lập trình trò chơi Flappy Bird. Học Viên được lợi gì khi mua khóa học: + Làm chủ ngôn ngữ lập trình Srcatch trong thời gian ngắn và đơn giản nhất. + Nắm được các khái niệm nâng cao về ngôn ngữ lập trình làm làm bước đệm vững chắc để học lên các khóa học công nghệ thông tin khác + Hiểu rõ hơn về thế giới công nghệ xung quanh, cách máy tính và các thiết bị di động thông minh nghĩ và hoạt động. + Làm chủ ngôn ngữ lập trình Scratch giúp học viên trang bị một công cụ mới trong rèn luyện tư duy cũng như phục học tập nghiên cứu các môn học khác như Toán, Lý, Hóa, Sinh học, Lịch sử.... + Phương thức học tập thuận tiện có hiệu quả kinh tế cao. Học viên có thể học ngôn ngữ lập trình mọi lúc, mọi nơi thông qua máy tính hoặc thiết bị di động có kết nối internet. + Nhận sự hỗ trợ tận tình từ các chuyên gia của Học Viện VIETSTEM."},
{"Link": "https://unica.vn/che-tao-robot-dieu-khien-bang-giong-noi", "Name": "unica", "Title": "Chế tạo robot điều khiển bằng giọng nói", "GV": "Phan Hoàng Anh", "Gioithieu": "Khóa học chế tạo robot điều khiển bằng giọng nói là khóa học đặc biệt dành cho các bạn mới tiếp cận với công nghệ robot hoặc những bạn đang theo học công nghệ thông tin Các học viên sẽ nắm vứng các kỹ năng lập trình điện thoại android nhận diện giọng nói để điều khiển robot. Sau khi kết thúc khóa học, học sinh sẽ có thể Lập trình điều khiển đèn và động cơ với arduino Gửi tín hiệu điều khiển từ máy tính tới robot thông qua dây usb bằng giao tiếp Serial Thành thạo lập trình ứng dụng điều khiển qua bluetooth cho điện thoại android với App Inventor 2 Nắm được công nghệ nhận diện giọng nói phát triển bởi Google"},
{"Link": "https://unica.vn/xay-dung-ung-dung-khong-can-code-voi-google-appsheet", "Name": "unica", "Title": "Làm chủ Google Appsheet từ cơ bản tới nâng cao", "GV": "Lê Văn Hòa", "Gioithieu": "Có phải bạn đang: Cảm thấy vất vả với việc quản lý công việc hàng ngày trên giấy tờ và bảng tính Excel? Bạn đang tìm kiếm một giải pháp để số hóa quy trình công việc và tăng cường hiệu quả cho doanh nghiệp của mình? Hãy để Google AppSheet giúp bạn! AppSheet là nền tảng giúp bạn xây dựng các ứng dụng doanh nghiệp mà không cần biết cách lập trình. Bạn có thể dễ dàng chuyển đổi bảng tính Excel hoặc Google Sheets của mình thành một ứng dụng hoạt động trên nhiều nền tảng như Android, iOS, và web. Khoá học sẽ mang lại cho bạn nhiều lợi ích: Tạo ứng dụng nhanh chóng và dễ dàng mà không cần biết cách lập trình Tăng cường hiệu quả quản lý thông tin và dữ liệu Tự động hóa quy trình công việc, giảm bớt thời gian và chi phí Cải thiện khả năng quản lý dự án và theo dõi tiến độ Tăng khả năng cạnh tranh bằng cách ứng dụng công nghệ vào quy trình kinh doanh của mình Giải phóng thời gian và tâm trí để tập trung vào những khía cạnh quan trọng khác của doanh nghiệp. Khóa học Xây dựng ứng dụng không cần code với Google Appsheet cung cấp kiến thức toàn diện về Google AppSheet - nền tảng giúp bạn tự xây dựng ứng dụng không cần biết code. Khóa học này giúp học viên làm quen với các tính năng nâng cao của AppSheet và sử dụng nó để chạy ứng dụng online trên nhiều nền tảng. Đây là lựa chọn lý tưởng cho doanh nghiệp vừa và nhỏ muốn tự động hoá và số hoá quy trình một cách chuyên nghiệp và hiệu quả. Đừng chần chừ nữa, đăng ký khoá học ngay, cùng khám phá cách thức để số hóa doanh nghiệp của bạn. AppSheet sẽ giúp bạn nâng cao hiệu suất công việc và tăng cường khả năng cạnh tranh của bạn trên thị trường."},
{"Link": "https://unica.vn/kien-thuc-co-ban-cho-nguoi-moi-di-lam-tai-cong-ty-phan-mem", "Name": "unica", "Title": "Kiến thức cơ bản cho nhân viên mới tại công ty phần mềm.", "GV": "Nguyễn Thiện Ân", "Gioithieu": "Bạn chuẩn bị đi làm tại công ty phần mềm, nhưng bạn lo lắng không biết công việc thực tế sẽ như thế nào, liệu có giống với những gì mình được học không? Đừng lo lắng, khoá học Kiến thức cơ bản cho người mới đi làm tại công ty phần mềm sẽ là trợ thủ đắc lực cho bạn tự tin bước chân vào môi trường mới. Cấu trúc bài học gần gũi với thực tế công ty phần mềm outsourcing (gia công phần mềm). Mỗi bài học đều giúp cho bạn hiểu rõ hơn và biết được cách thức làm việc của công ty phần mềm như thế nào? Khi bước vào công ty, bạn sẽ không bất ngờ với các quy trình cũng như cách thức làm việc. Ngoài ra, khóa học còn giúp bạn nâng cao kiến thức của mình về quy trình dự án, kỹ năng giao tiếp, kỹ năng báo cáo, cũng như quản lý công việc một cách khoa học. Tham gia khoá học bạn sẽ hiểu được các quy tình trong công ty phần mềm (outsourcing - gia công phần mềm), hiểu được bảo mật thông tin trong công ty, bảo mật thông tin trong dự án là như thế nào và các biện pháp bảo mật thông tin ra sao. Bạn cũng sẽ nắm được quy luật làm việc nhóm, các nhóm người trong nhóm, các kỹ năng cần có trong làm việc nhóm để phát huy tối đa năng lực của mình. Biết các số liệu NORM (tiêu chuẩn) trong dự án và cách làm đánh giá về chất lượng trong dự án, các thuật ngữ trong ngành phần mềm xây dựng CV, Resume chuyên nghiệp hơn. Ngoài ra, giảng viên còn hướng dẫn bạn chuẩn bị tốt CV, resume để tự tin đi phỏng vấn. Còn chần chừ gì nữa, nhanh tay đăng ký khoá học để nhận ưu đãi từ Unica nào!"},
{"Link": "https://unica.vn/khoa-hoc-scrum-master-i", "Name": "unica", "Title": "Luyện thi chứng chỉ Scrum Master I (PSM I) và Product Owner I (PSPO I)", "GV": "Trần Hữu Tấn", "Gioithieu": "Chứng chỉ Scrum Master là gì? Hiện nay, Aglie được áp dụng rộng rãi không chỉ trong lĩnh vực phát triển phần mềm mà còn được áp dụng trong nhiều lĩnh vực khác như Marketing, Financial, Manufacturing, HR, Education… Trong đó, Scrum luôn là framework được sử dụng rộng rãi nhất trong nhóm các Agile methodologies. Do đó, việc học và thi lấy chứng chỉ Scrum Master là sự chuẩn bị cần thiết cho công việc hiện tại và tương lai. Đặc biệt quan trọng với những bạn sinh viên học công nghệ thông tin. Scrum được giới thiệu trước công chúng năm 1995 bởi Ken Schwaber và Jeff Sutherland. Ken và Jeff cũng là 02 trong số 17 vị đồng ký tên vào bản tuyên ngôn Agile ra đời sau đó 6 năm vào năm 2001. Nghe có vẻ rất mơ hồ phải không? Chính vì thế, khóa học Luyện thi chứng chỉ Scrum Master I (PSM I) và Product Owner I (PSPO I) của giảng viên Trần Hữu Tấn trên UNICA ra đời để giúp bạn hiểu các thành phần của Scrum. Nội dung khóa học scrum master Khóa học bao gồm 20 bài giảng và thời lượng học là 02 giờ 37 phút. Nội dung của khóa học tập trung vào các kiến thức về Agile/Scrum, giúp bạn có kiến thức cơ bản để vận hành một nhóm theo Agile/Scrum cũng như có đầy đủ kiến thức để vượt qua chứng chỉ Professional Scrum Master I (PSM I) và Professional Scrum Product Owner I (PSPO I) của Scrum. org. Khoá học thiết kế giúp cho học viên có đầy đủ kiến thức để vượt qua chứng chỉ Professional Scrum Master I và Professional Scrum Product Owner I một cách dễ dàng. Bên cạnh lý thuyết, học viên cũng sẽ được học những mẹo để có thể trả lời các câu hỏi trong đề thi thật. Sau mỗi phần học có các câu hỏi trắc nghiệm giúp học viên ôn tập và tổng hợp lại kiến thức, sau khi làm xong bài tập, học viên sẽ được xem giải thích đáp án cho từng câu hỏi. Trong khoá học sẽ có 03 đề thi sát với đề thi thật, hai đề đầu tiên tập trung vào chứng chỉ PSM I, đề thứ 3 tập trung vào chứng chỉ PSPO I. Tuy nhiên các bạn muốn thi PSPO I phải thành thạo cả 3 đề. Trong 3 đề đó, mỗi đề có 80 câu và làm trong 60 phút. Học viên được khuyến khích làm đề thi thử cho đến khi đạt 100% nhiều lần trước khi làm đề thi thật. Lưu ý: Bên cạnh khóa học này, học viên nên đọc Scrum Guide để bổ sung kiến thức về Scrum. Hãy nhanh tay đăng ký khóa học Luyện thi chứng chỉ Scrum Master I (PSM I) và Product Owner I (PSPO I) ngay hôm nay trên UNICA!"},
{"Link": "https://unica.vn/khoa-hoc-lap-trinh-iot-danh-cho-nguoi-moi-bat-dau", "Name": "unica", "Title": "Khoá học lập trình IOT dành cho người mới bắt đầu", "GV": "Nhí Võ - VVNPRO", "Gioithieu": "Trong những năm gần đây, từ khóa IoT ngày càng trở nên phổ biến. Công nghệ Internet of Things - IoT là khái niệm được ví như một “kịch bản công nghệ của Thế giới” và được dự đoán rằng sẽ phát triển trở thành ngành công nghiệp cực kỳ giá trị trong vài năm tới. Tuy nhiên, theo các con số thống kê, số lượng lập trình viên tham gia vào IoT hiện nay rất ít. Sẽ là một cơ hội lớn để phát triển trong tương lai nếu bạn muốn đi theo xu hướng IoT.  Khóa học lập trình IoT cơ bản dành cho người mới bắt đầu sẽ giúp học viên định hướng được các thành phần trong hệ thống IoT, các học viên sẽ được tiếp cận từng lớp từ Device - Server - Application. Ứng với mỗi lớp khóa học sẽ cung cấp các công cụ, kỹ năng và ngôn ngữ lập trình cần thiết để nắm vững kiến thức, qua đó sẽ biết được đâu là thế mạnh của bản thân để cùng đội nhóm phát triển những sản phẩm tối ưu nhất. Bạn sẽ học được tất cả các ngôn ngữ lập trình trong hệ thống IoT Device ( C, C+, Arduino, Pic, Sensor, Ajax) Server ( Nodejs, Database, Mongo, HTML, React) Application ( React native, Nodejs, Javascript, Objective C). Các công cụ bao gồm : Visual Studio Code, Sublinetext, Dot, Altium PCB, Android Studio, Arduino IDE, Xcode,. Các kỹ năng thiết kế phần cứng, ứng dụng thực tiễn Xây dựng ứng dụng chuẩn IoT bao gồm 3 lớp. Nhanh tay đăng ký khoá học để trở thành một trong những người thành công với công nghệ IOT nhé!    "},
{"Link": "https://unica.vn/lap-trinh-ios-swift", "Name": "unica", "Title": "Lập trình iOS Swift", "GV": "Nhóm giảng viên Lập Trình 0 Khó", "Gioithieu": "Trong khóa học Lập trình iOS Swift, bạn sẽ được hướng dẫn các kiến thức lập trình iOS của Apple đó là Swift 5. Nội dung gồm có kiến thức gồm có - Làm việc với Xcode - Làm việc với UI - Kiến thức lập trình với Swift - Làm việc Gesture - Làm việc với Tableview Hoàn thành khoá học bạn có thể tự tay viết cho mình một ứng dụng iOS cơ bản, nếu đam mê thì bạn có thể tự học công nghệ thông tin để phát triển nghề nghiệp sau này."},
{"Link": "https://unica.vn/huong-dan-day-du-ve-asp-net-core-mvc-net-6", "Name": "unica", "Title": "Hướng dẫn đầy đủ về ASP.NET Core MVC (.NET 6)", "GV": "Phạm Thanh Tan", "Gioithieu": "Bạn mới làm quen với ASP.NET Core hoặc bạn đã quen thuộc với ASP.NET và muốn bắt đầu tìm hiểu những điểm khác biệt trong ASP.NET Core? Khoá học Hướng dẫn đầy đủ về ASP.NET Core MVC (.NET 6) xây dựng nhiều dự án để hiểu tất cả các khái niệm trong .NET 6, vì chúng tôi sẽ triển khai ứng dụng của mình trên Azure cũng như IIS. Trong suốt khóa học này, các bạn sẽ hiểu sự phát triển của ASP.NET Core, sau đó sẽ xem xét các tệp và cấu trúc thư mục đã được sửa đổi. Tôi sẽ giới thiệu các khái niệm mới trong ASP.NET Core Chúng tôi sẽ xây dựng một ứng dụng Razor pager nhỏ bằng cách sử dụng khung Entity để tích hợp với cơ sở dữ liệu. chúng tôi sẽ học các chủ đề nâng cao trong ASP.NET MVC Core    "},
{"Link": "https://unica.vn/lap-trinh-web-voi-nodejs-express-mongodb", "Name": "unica", "Title": "Lập trình web với Nodejs, Express, MongoDB", "GV": "Đinh Nguyễn Trọng Nghĩa", "Gioithieu": "NodeJS là nền tảng back-end được viết bằng JavaScript. NodeJS sử dụng model event-driven, non-blocking I/O để tạo Apps vô cùng mạnh mẽ. Express là một web app framework trên nền tảng Node.js. Hỗ trợ các method HTTP và Middleware tạo ra các API vô cùng mạnh mẽ và dễ sử dụng. MongoDB là một cơ sở dữ liệu NoSQL hướng đối tượng, đơn giản, linh động và có thể mở rộng. Nó dựa trên mô hình lưu trữ NoSQL document. Các đối tượng dữ liệu được lưu trữ dưới dạng các tài liệu riêng biệt bên trong một collection – thay vì lưu trữ dữ liệu vào các cột và hàng của cơ sở dữ liệu quan hệ truyền thống. Khóa học Lập trình web với Nodejs, Express, MongoDB giúp bạn làm chủ những kiến thức NodeJS, Express, MongoDB; phát triển đầy đủ kĩ năng và nắm vững các công cụ này để phục vụ cho các project thực tế. Các công cụ này là tổ hợp các công nghệ cực kì mạnh mẽ để xây dựng các ứng dụng web chuyên nghiệp, đòi hỏi những kĩ thuật cao mà các công ty hiện nay đang rất cần nhân lực. Nhanh tay đăng ký khoá học để nhận ưu đãi từ Unica nhé!"},
{"Link": "https://unica.vn/khoa-hoc-html-css-tu-co-ban-den-nang-cao-2023-sass", "Name": "unica", "Title": "Khóa học HTML & CSS từ cơ bản đến nâng cao 2023 (Sass)", "GV": "Nguyễn Duy Khánh", "Gioithieu": "Khóa học HTML & CSS từ cơ bản đến nâng cao 2023 (Sass) dành cho những người mới bắt đầu tìm hiểu về web hoặc những người quên đi kiến thức về HTML & CSS do không sử dụng nó trong một khoảng thời gian dài. Đây là những kiến thức không thể thiếu cho một lập trình viên web chuyên nghiệp. Bạn sẽ hiểu rõ về HTML, CSS và cách hoạt động của chúng như thế nào trong một trang web. Ngoài ra bạn còn có thể biết cách responsive để chúng hiển thị ở các loại thiết bị khác nhau tùy theo ý muốn của bạn. Bạn sẽ được học lí thuyết gắn với thực hành, giúp cho mấy bạn nắm vững được những kiến thức vừa học. Đặc biệt đây sẽ là khóa học cô đọng lại kiến thức về HTML, CSS giảng viên đã tích lũy trong một khoảng thời gian dài làm việc trong lĩnh vực web. Nắm vững các kiến thức quan trong trong CSS như: grid css, flexbox, position, animation, ... Nhanh tay đăng ký khoá học để nhận ưu đãi từ Unica nhé!"},
{"Link": "https://unica.vn/aws-certified-solutions-architect-associate-saa-c03", "Name": "unica", "Title": "AWS Certified Solutions Architect - Associate (SAA-C03)", "GV": "Lưu Hồ Phương", "Gioithieu": "AWS Certified Solutions Architect là một trong những chứng chỉ điện toán đám mây có giá trị và được tìm kiếm nhiều nhất trên thế giới, việc trở thành một AWS Solution Architect Associate là một bước đầu tiên để trở thành một chuyên gia đám mây AWS. Khóa học này được thiết kế chương trình đào tạo chứng nhận kiến trúc sư đám mây cho bất kỳ ai muốn tìm hiểu các thành phần dịch vụ chính của Amazon Web Services (AWS). Khi kết thúc khóa học, bạn sẽ sẵn sàng có được kiến thức để tham gia kỳ thi AWS Certified Solutions Architect – Associate. Khóa học này dành cho ai? Chúng ta sẽ bắt đầu với cái nhìn tổng quan về nền tảng AWS. Không cần kiến thức lập trình và không yêu cầu kinh nghiệm AWS trước đó. Ngay cả khi bạn chưa từng đăng nhập vào nền tảng AWS trước đó, bạn sẽ xây dựng nền tảng kiến thức để vượt qua kỳ thi AWS Certified Solutions Architect – Associate sau khi hoàn thành khóa đào tạo cấp chứng chỉ của chúng tôi. Những gì được bao gồm trong khóa học này? Tôi biết bạn không có nhiều thời gian, vì vậy khóa đào tạo của tôi bao gồm các video dài từ 5 đến 15 phút mà bạn có thể xem một cách thuận tiện. Các bài học qua video của tôi luôn đơn giản, giải thích rõ ràng và ngắn gọn. Tôi sẽ hướng dẫn bạn qua từng lĩnh vực chính của Amazon Web Services, từng bước một. Sử dụng các ví dụ thực tế, chúng ta sẽ thực hành cách thiết kế và quản lý cơ sở hạ tầng ứng dụng hiệu quả bằng AWS. Ở cuối mỗi phần, Tôi cũng sẽ kiểm tra kiến thức của bạn bằng các câu hỏi ngắn để đảm bảo bạn hiểu bài và chuẩn bị cho bạn tham gia kỳ thi. Với nội dung được cập nhật mới nhất và giảng viên có chuyên môn cao, nhiều kinh nghiệm trong thực chiến, chúng tôi tự hào cung cấp một trải nghiệm học tập tuyệt vời cho những ai muốn trở thành một AWS Solution Architect Associate. Nhanh tay đăng ký khoá học để nhận ưu đãi từ Unica nhé!"},
{"Link": "https://unica.vn/bat-dau-tu-duy-lap-trinh-cung-scratch", "Name": "unica", "Title": "Bắt đầu tư duy lập trình cùng Scratch", "GV": "Nguyễn Việt Dũng", "Gioithieu": "Lập trình scratch là một công cụ lập trình phổ thông dành riêng cho trẻ em ở độ tuổi từ 7 – 13 tuổi được nghiên cứu và phát triển bởi nhóm Lifelong Kindergarten thuộc trung tâm Media Lab của viện công nghệ Massachusetts – MIT, Hòa Kỳ. Khi tham gia khóa học lập trình Scratch, trẻ em học được những nguyên lý cơ bản của việc thiết kế chương trình, học được cách thử nghiệm ý tưởng mới, học được cách phân chia ý tưởng phức tạp thành những phần việc đơn giản, học được cách hợp tác, làm việc nhóm để thực hiện dự án, học được cách tìm và sửa lỗi khi kết quả không được như ý, rèn luyện được tính kiên trì khi đối mặt với khó khăn. Khoá học Bắt đầu tư duy lập trình cùng Scratch không chỉ dạy kiến thức lập trình Scratch cơ bản mà còn chú trọng bồi dưỡng các khái niệm lập trình cốt lõi và tư duy của kỹ sư lập trình. Khoá học hướng đến mục tiêu: Học viên sẽ được học tất cả các khối lệnh cơ bản của Scratch, làm tiền đề vững vàng để học viên có thể tự học Scratch hay lập trình trong tương lai Học viên sẽ bắt đầu làm quen với các khái niệm lập trình cốt lõi: chuỗi, vòng lặp, song song, sự kiện, điều kiện, toán tử, dữ liệu Học viên sẽ thực hành cách tư duy của kỹ sư lập trình: thử nghiệm & lặp, kiểm tra & sửa lỗi, tái sử dụng chương trình, tổng hợp & phân tích Tại sao nên mua khóa học? Với mục tiêu hướng đến những học viên chưa từng có kinh nghiệm hoặc mới tìm hiểu về lập trình, khóa học sẽ hướng dẫn trực quan, chi tiết, rõ ràng từng bước để học viên dễ dàng theo dõi. Sau khóa học, học viên có thể tự tin tự mình học Scratch qua sách, video, hay các khóa học nâng cao khác. Quan trọng hơn, là học viên sẽ bắt đầu xây dựng cho mình một nền tảng vững chắc về các khái nhiệm lập trình và tư duy của kỹ sư lập trình, 2 yếu tố giúp học viên có cái nhìn sâu sắc hơn về cách mà công nghệ vận hành từ bên trong chứ không chỉ tương tác từ phía ngoài như người dùng, và sẽ tiếp tục được học viên bồi đắp nếu có hứng thú với việc lập trình trong tương lai. Nhanh tay đăng ký khoá học để nhận ưu đãi từ Unica nhé!"},
{"Link": "https://unica.vn/an-ninh-mang-cho-nguoi-moi-bat-dau", "Name": "unica", "Title": "An ninh mạng cho người mới bắt đầu", "GV": "Nguyễn Khánh Tùng", "Gioithieu": "Kiến thức cơ bản cho người mới bắt đầu tìm hiểu về lĩnh vực an ninh mạng, bao gồm: Tầm quan trọng của việc bảo vệ thông tin cá nhân và thông tin của tổ chức trên mạng Nhận diện những kẻ tấn công mạng Tấn công mạng, khái niệm và các kỹ thuật Cách bảo vệ dữ liệu và sự riêng tư trên không gian mạng Con đường nghề nghiệp trong lĩnh vực an ninh mạng Khóa học bao gồm các bài Lab thực hành minh họa Tại sao nên học khóa học này: Sau khóa học, các bạn trẻ đang tìm hiểu về an ninh mạng có thể tìm thấy lời giải đáp cho câu hỏi nên bắt đầu đi vào con đường an ninh mạng như thế nào? Nên học những gì? Cơ hội nghề nghiệp trong lĩnh vực này? Làm thế nào để trở thành một chuyên gia an ninh mạng giỏi. Khóa học được thiết kế theo dạng Slide tiếng Anh và giải thích bằng tiếng Việt, giúp người học có thêm vốn từ tiếng Anh chuyên ngành an ninh mạng Sau khóa học, học viên có thể thi lấy chứng nhận hoàn thành khóa học do hãng bảo mật nổi tiếng thế giới Cisco cấp (hoàn toàn miễn phí) Nhanh tay đăng ký khóa học để nhận ưu đãi từ Unica nhé!"},
{"Link": "https://unica.vn/kien-thuc-co-ban-ve-an-ninh-mang", "Name": "unica", "Title": "Kiến thức cơ bản về an ninh mạng", "GV": "Nguyễn Khánh Tùng", "Gioithieu": "Khóa học Kiến thức cơ bản về an ninh mạng bao gồm kiến ​​thức nền tảng và các kỹ năng cần thiết trong tất cả các lĩnh vực an ninh trong không gian mạng - bảo mật thông tin, bảo mật hệ thống, an ninh mạng, bảo mật di động, bảo mật vật lý, đạo đức và luật pháp, các công nghệ liên quan, kỹ thuật phòng vệ và giảm thiểu rủi ro. Khóa học sẽ giúp bạn hiểu về thế giới an ninh mạng và động cơ của tội phạm mạng và công việc phòng chống của các chuyên gia an ninh mạng. Cách phát hiện các cuộc tấn công, từ đó xây dựng quy trình và biện pháp đối phó. Khóa học cung cấp kiến ​​thức nền tảng trong lĩnh vực an ninh mạng, các kỹ năng thông qua nhiều bài thực hành. Ngoài ra các kiến thức về pháp luật, đạo đức và cách phát triển các chính sách bảo mật cũng được đề cập trong khóa này. Sau khóa học, học viên sẽ có các kỹ năng để thực hiện các nhiệm vụ sau: Mô tả các đặc điểm của tội phạm và các chuyên gia trong thế giới an ninh mạng. Mô tả các nguyên tắc về tính bảo mật, tính toàn vẹn và tính sẵn dùng liên quan đến trạng thái của dữ liệu và các biện pháp đối phó an ninh mạng. Mô tả các chiến thuật, kỹ thuật và các bước tấn công được sử dụng bởi tội phạm mạng. Mô tả cách các công nghệ, sản phẩm và quy trình được sử dụng để bảo vệ tính bí mật. Mô tả cách sử dụng công nghệ, sản phẩm và quy trình để đảm bảo tính toàn vẹn. Mô tả cách các công nghệ, sản phẩm và quy trình cung cấp tính sẵn dùng cao. Giải thích cách các chuyên gia an ninh mạng sử dụng công nghệ, quy trình và thủ tục để bảo vệ tất cả các thành phần của mạng. Giải thích mục đích của các luật liên quan đến an ninh mạng Nhanh tay đăng ký khóa học để nhận ưu đãi từ Unica nhé!"},
{"Link": "https://unica.vn/cau-truc-du-lieu-giai-thuat-tap-2", "Name": "unica", "Title": "Cấu Trúc Dữ Liệu & Giải Thuật - Tập 2", "GV": "Trần Duy Thanh", "Gioithieu": "- Khóa học cung cấp kiến thức về Cấu trúc dữ liệu và giải thuật - Khoá học cung cấp kiến thức nền cơ bản trong việc học công nghệ thông tin - Cung cấp những cơ hội thực hành tạo ứng dụng CTD và Giải thuật với C++ ngay trong quá trình học - Sau khi hoàn thành khóa học của giảng viên Trần Duy Thanh, học viên sẽ có kiến thức để tiếp tục học các môn khác nhau: Python, lập trình Java, lập trình Android, C#... - Cài đặt cấu trúc dữ liệu và giải thuật bằng C++ - Hàm và đệ qui - Các giải thuật tìm kiếm: Tuyến tính, nhị phân - Các giải thuật sắp xếp: Bubble Sort, selection sort , quick sort... - Danh sách liên kết: Đơn, đôi - Stack và Queue - Tree: Cây nhị phân tìm kiếm - Cơ bản về đánh giá giải thuật"},
{"Link": "https://unica.vn/lap-trinh-java-core-can-ban", "Name": "unica", "Title": "Lập trình java core căn bản", "GV": "Đỗ Hữu Phúc", "Gioithieu": "Bạn có biết: Java là một ngôn ngữ lập trình có đã được sử dụng để tạo ra phần mềm cho nhiều nền tảng. Một ứng dụng bằng ngôn ngữ Java có thể chạy trên hầu hết các hệ điều hành như Windows, Linux, Solaris và Mac OS. Bạn hoàn toàn có thể tải miễn phí Java bản mới nhất tại oracle.com. Các thiết bị điện tử xung quanh bạn đều có Java. Ngay cả đến thiết bị mà bạn đang dùng để đọc bài viết này, máy tính để bàn, laptop, điện thoại di động, máy tính bảng, TV, cây ATM, máy nghe nhạc, máy in,mạng Internet… đa số những thứ có dữ liệu đều sử dụng ngôn ngữ lập trình Java. Theo thống kê cho thấy, hầu hết các máy tính để bàn đều hoạt động bằng ngôn ngữ lập trình Java và nó đang có ở trong gần như tất cả các thiết bị di động trên Thế giới. Vì thế, lập trình viên java là một trong những nghề được săn đón nhiều nhất ở trên thế giới. Nếu bạn là một người muốn theo đuổi mơ ước trở thành một lập trình viên, thì việc lựa chọn ngôn ngữ lập trình java để học là một trong những quyết định đúng đắn. Khóa học Lập trình java core căn bản sẽ là khởi đầu cho con đường trở thành lập trình viên của bạn. Nội dung khóa học: Khóa học gồm các nội dung chính như sau: - Cách thiết lập và cài đặt môi trường phát triển ngôn ngữ lập trình java - Sử dụng công cụ eclipse để xây dựng ứng dụng java - Các khái niệm cơ bản về lập trình hướng đối tượng: lớp, kế thừa, trừu tượng hóa, giao diện,.. - Các từ khóa trong lập trình java - Điều khiển trong lập trình java - Vòng lặp trong lập trình java - Và rất nhiều các cú pháp cũng như cấu trúc khác trong lập trình java Vậy, còn đắn đo gì mà bạn không đăng ký ngay khóa học Lập trình java core căn bản trên UNICA"},
{"Link": "https://unica.vn/quan-tri-oracle-database-nang-cao-quan-ly-kien-truc-multitenant", "Name": "unica", "Title": "Quản trị Oracle Database nâng cao - Quản lý kiến trúc Multitenant", "GV": "Đặng Xuân Duy", "Gioithieu": "Kiến trúc Multitenant là một tính năng tiến tiến của Oracle Database, bắt đầu được giới thiệu từ phiên bản 12c. Kiến trúc này cho phép một Container Database (CDB) có thể chứa nhiều Pluggable Database (PDB), giúp tách biệt việc quản lý các dữ liệu và cấu hình riêng biệt cho từng phòng ban hoặc dự án trong tổ chức. Khoá học Quản trị Oracle Database nâng cao - Quản lý kiến trúc Multitenant sẽ giúp bạn làm chủ kiến trúc Multitenant và áp dụng nó để cải tiến quy trình công việc tại Công ty của bạn và cung cấp nhiều lợi ích như: Tiết kiệm chi phí vận hành và bảo mật tốt hơn, bằng cách chia sẻ tài nguyên và sử dụng các tính năng quản lý chung cho tất cả các PDB. Giảm thời gian cài đặt và vận hành với việc quản lý tất cả các PDB trong một giao diện duy nhất. Hiện nay, ở Việt Nam, kiến trúc Multitenant thường được áp dụng để xây dựng hệ thống Private Database Cloud cho doanh nghiệp hoặc tổ chức lớn. Và nó đang ngày càng phát triển và phổ biến. Nội dung khoá học: So sánh kiến trúc Multitenant và kiến trúc truyền thống Quản lý các thành phần mới trong kiến trúc Multitenant Làm việc với Container Database và Pluggable Database Backup và Recovery trong kiến trúc Multitenant Di chuyển và tích hợp dữ liệu trong kiến trúc Multitenant"},
{"Link": "https://unica.vn/quan-tri-csdl-oracle-12c-co-ban", "Name": "unica", "Title": "Quản trị CSDL Oracle 12c cơ bản", "GV": "TRẦN VĂN BÌNH", "Gioithieu": "Bạn có biết: Dữ liệu được coi là \"trái tim của doanh nghiệp\" và là tài sản quý giá nhất của mỗi doanh nghiệp, đặc biệt trong thời đại bùng nổ thông tin như hiện nay, doanh nghiệp nào càng có nhiều dữ liệu, nếu biết cách khai thác sẽ đem lại hiệu quả rất cao, có lợi thế cạnh tranh. Việc bảo vệ an toàn, quản trị dữ liệu đảm bảo hiệu năng cao là công việc được đánh giá rất cao trong mỗi doanh nghiệp hiện nay. Không những thế, bạn đang mong muốn quản trị dữ liệu nhân sự một cách khoa học và logic, hiệu quả nhất. Nhưng bạn vẫn đang loay hoay vì nó tốn quá nhiều thời gian học công nghệ thông tin để bạn có thể hiểu được bản chất của cơ sở dữ liệu. Chính vì thế, bạn hãy tìm đến khóa học Quản trị CSDL Oracle 12c cơ bản của giảng viên Trần Văn Bình trên Unica.vn. Nội dung khóa học Khóa học Oracle bao gồm 76 bài giảng và thời lượng học là 09 giờ 33 phút, với 4 phần nội dung. Khóa học sẽ cung cấp những thông tin, kiến thức cốt lõi về quản trị CSDL Oracle tốt nhất thế giới và phức tạp nhất hiện nay: ✔️ Kiến trúc CSDL ✔️  Cấu hình CSDL để tương thích với ứng dụng   ✔️ Sử dụng các công cụ quản trị ✔️ Các tác vụ quản trị CSDL (quản trị tablespace, undo, redo, archive log, object, tắt/bật listener, tắt/bật database instance, …) ✔️ Giám sát CSDL, lock và quản lý hiệu năng ✔️ Quản lý tài nguyên và các job tự động của CSDL ✔️ Quản trị backup, recovery ✔️ Quản trị bảo mật CSDL và thực thi audit  ✔️ Chuyển dữ liệu giữa các CSDL và file ✔️ Phát hiện, chẩn đoán, khắc phục lỗi, sự cố và làm việc với Oracle Support Vậy, còn đắn đo gì mà bạn không đăng ký ngay khóa học Quản trị CSDL Oracle 12c cơ bản trên UNICA."},
{"Link": "https://unica.vn/quan-tri-he-dieu-hanh-linux-trong-21-gio", "Name": "unica", "Title": "Quản trị Hệ điều hành Linux trong 21 giờ", "GV": "TRẦN VĂN BÌNH", "Gioithieu": "Bạn có biết: Sự độc bá của Windows và Mac OS không ngăn cản được những hệ điều hành phát triển. Hệ điều hành mã nguồn mở như Linux vẫn phát triển mạnh mẽ. Ngoài những chức năng thường, Linux còn sở hữu nhiều ưu điểm vượt trội khác. Không tốn chi phí mua/bán bản quyền, tính bảo mật cao, tính linh hoạt, hoạt động “mượt” trên các máy tính có cấu hình yếu. Vậy quản trị hệ điều hành Linux như thế nào? Hệ điều hành Linux được phát triển dựa vào hệ điều hành Unix và được phát hành miễn phí. Server Linux thường được sử dụng nhiều hơn là Window hay bất cứ kỳ hệ điều hành nào khác. Hệ điều hành máy tính đang được sử dụng rộng rãi trong thời gian gần đây. Tuy nhiên sử dụng hệ điều hành này như nào để sử dụng hết ưu điểm của nó thì không phải ai cũng biết. Chính vì thế, hãy đến ngay với khóa học Quản trị Hệ điều hành Linux trong 21 giờ của giảng viên Trần Văn Bình trên UNICA.  Nội dung khóa học linux online Khóa học bao gồm 31 bài giảng và thời lượng học là 06 giờ 23 phút. Khóa học cung cấp cho học viên tất cả các kiến thức cũng như các bài  thực hành về hệ điều hành Linux được chọn lọc từ môi trường thực tế do chuyên gia Quản trị hệ thống trên các hệ thống rất lớn, online 24/7 tại Việt Nam tuyển chọn như cài đặt Linux, cài đặt phần mềm; quản lý user, group, quản lý phần cứng, quản lý disk, storage, quản lý file, quản lý hệ thống file, quản lý dịch vụ, quản lý tiến trình, quản lý tài nguyên, quản lý mạng, bảo mật, quản lý quá trình khởi động hệ thống, bảo trì hệ thống, khắc phục sự cố. Quản lý các dịch vụ thông dụng như Apache, NTP, WebServer. Đăng ký khóa học Quản trị Hệ điều hành Linux trong 21 giờ tại Unica.vn để nhanh chóng nắm chắc kỹ năng quản trị hệ điều hành Linux chỉ trong 21 giờ. Ngoài ra còn rất nhiều những khoá học công nghệ thông tin online hấp dẫn khác đang chờ bạn khám phá."},
{"Link": "https://unica.vn/lap-trinh-huong-doi-tuong-voi-ngon-ngu-c-c", "Name": "unica", "Title": "Lập trình hướng đối tượng với ngôn ngữ C/C++", "GV": "Nguyễn Anh Vũ", "Gioithieu": "Có phải bạn là: Sinh viên đang cần nghiên cứu về lập trình hướng đối tượng? Bạn đã biết căn bản về lập trình C và đang mong muốn chuyển tiếp sang mô hình lập trình trong các dự án thực tế? Bạn có nhu cầu học về lập trình C ++? Khóa học Lập trình hướng đối tượng với ngôn ngữ C/C++ của giảng viên Nguyễn Anh Vũ - Kĩ sư lập trình - Từng 5 năm công tác tại Viettel với các hệ thống huấn luyện quân sự. Hiện tại đang công tác tại Asilla Việt Nam chuyên về các hệ thống trí tuệ nhân tạo. Khóa học sẽ giúp bạn: Hiểu được triết lý và tinh thần của mô hình hướng đối tượng Vận dụng và thiết kế 1 phần mềm theo mô hình này Những khái niệm cơ bản và tính chất của mô hình lập trình hướng đối tượng Bạn còn chần chừ gì nữa, nhanh tay đăng ký ngay khóa học để chinh phục được lập trình hướng đối tượng với ngôn ngữ C/C++. Lập Trình Không Khó, Có Anh Vũ Lo."},
{"Link": "https://unica.vn/basic-javascript-for-developers", "Name": "unica", "Title": "Basic JavaScript for Developers", "GV": "Hoàng Văn Công", "Gioithieu": "Mình có hơn 4 năm làm C++ (Automotive) và 1,5 năm trở lại đây mình chuyển sang làm Web (fullstack). Các công nghệ chính mình đang sử dụng là: VueJS/ReactJS ExpressJS và NestJS. Khóa học dưới đây mình tạo ra nhằm giúp các bạn nào đã biết một ngôn ngữ lập trình rồi có thể nắm bắt nhanh được ngôn ngữ JavaScript (cho dù bạn theo FrontEnd hay BackEnd). Như mọi người đã biết, khi chúng ta đã biết một ngôn ngữ lập trình rồi thì việc học một ngôn ngữ mới rất nhanh! Chính vì vậy mà khóa học này chỉ chỉ ra những gì thực sự quan trọng và khác biệt giữa javascript và các ngôn ngữ khác! Giúp các bạn không phải mất thời gian với các khóa học hàng chục giờ dành cho người mới bắt đầu, lặp đi lặp lại những gì mà các bạn đã biết!  "},
{"Link": "https://unica.vn/khoa-hoc-lap-trinh-ung-dung-di-dong-app-inventor", "Name": "unica", "Title": "Khóa học lập trình ứng dụng di động App Inventor", "GV": "Học viện VIETSTEM", "Gioithieu": "Bạn thân mến, Các thiết bị di động, đặc biệt là điện thoại ngày càng \"thông minh\", vượt xa ý tưởng của những nhà sản xuất trước đó, không chỉ là phương tiện nghe gọi phổ biến, bạn còn có thể lướt web, xem phim, đọc báo, chia sẻ thông tin cá nhân, kết bạn, điều hành công việc, quay video, chụp những bức hình sắc nét, thậm chí là dựng các clip ngắn với đầy đủ nội dung và ý nghĩa... Các thiết bị này đem lại cho bạn quá nhiều tiện ích? Bạn nhận lấy những tiện ích này một cách thụ động? Bạn muốn tự mình thiết lập và xây dựng hoàn thiện ứng dụng di động cho riêng mình? Bạn có từng nghĩ sẽ tự tạo ra các ứng dụng và dịch vụ di động trên chính thiết bị di động của bản thân, dù chưa có kiến thức học công nghệ thông tin? Hãy đến với \"Khóa học lập trình ứng dụng di động App Inventor\" tại Unica.vn. App Inventor được dùng để phát triển phần mềm ứng dụng trên hệ điều hành Android, đây là công cụ lập trình dành cho mọi người, kể cả trẻ em. Được công bố dưới dạng phần mềm tự do (free software), App Inventor trở thành hiện tượng chưa từng có trong lĩnh vực lập trình cho thiết bị di dộng. App Inventor sẽ hỗ trợ người dùng để tạo các ứng dụng và dịch vụ di động, dù chưa học ngôn ngữ lập trình.  Trong lĩnh vực giáo dục, App Inventor là công cụ mạnh mẽ cho phép giáo viên hướng dẫn học sinh của mình làm quen với việc lập trình, giúp học sinh trở thành người sáng tạo công nghệ, thay vì chỉ là người thụ hưởng công nghệ Tham gia khóa học này bạn sẽ có thể:     ✔️ Nhanh chóng nắm được cac kiến thức cơ bản về App Inventor     ✔️ Được thực hành và sớm tự biết cách lập trình tới 6 trò chơi và ứng dụng cơ bản cực nổi tiếng hội tụ và yêu cầu đầy đủ toàn bộ kiến thức và kỹ năng lập trình bằng App Inventor     ✔️ Hoàn thiện hơn kỹ năng lập trình app di động với App Inventor cho người học.     ✔️ Được cung cấp và cập nhật thêm nhiều kỹ năng và kinh nghiệm lập trình app hoàn thiện và nhanh chóng. Vậy còn chờ gì nữa, hãy tham gia khóa học \"Khóa học lập trình ứng dụng di động App Inventor\"ngay hôm nay để tự tay xây dựng và hoàn thiện app ứng dụng di động cho riêng mình!"},
{"Link": "https://unica.vn/lap-trinh-voi-scratch-3-0-co-ban", "Name": "unica", "Title": "Lập trình với Scratch 3.0 cơ bản", "GV": "Học viện VIETSTEM", "Gioithieu": "Nội dung khóa học \"Lập trình Scratch 3 cơ bản\" Khóa học bao gồm 4 dự án chính và được chia thành các nội dung kiến thức nhỏ giúp học viên hiểu và dễ dàng hoàn thành dự án. Mèo đuổi chuột Trong dự án, học viên sẽ hiểu được cách để nhân vật di chuyển theo một đối tượng khác và đuổi theo đối tượng khác, hiểu cơ bản về vòng lặp và các khối lệnh sự kiện Thiệp sinh nhật động Qua dự án này, bước đầu học viên sẽ sử dụng các công cụ vẽ để tạo hình các nhân vật cơ bản như chiếc chong chóng và vẽ nền cho dự án. Sau bước tạo hình, học viên sẽ học cách để các đối tượng trên tấm thiệp chuyển động và xoay. Ví dụ: chong chóng xoay, nến cháy, mũ nhảy bóng bay bay lên và sao nhấp nháy.... Ngoài ra các học viên sẽ được tìm hiểu thêm về khu âm thanh cũng như cách thêm nhạc nền cho dự án sinh động và hấp dẫn hơn. Đường lên đỉnh Olympia Dự án Đường lên đỉnh Olympia là một dự án kết hợp giữa học và chơi. Học viên sẽ tạo ra một dự án và lập trình để Doraemon đưa ra các câu hỏi toán học và yêu cầu Nobita trả lời các câu hỏi đó. Người chơi sẽ đóng vai trò trả lời câu hỏi của Doraemon và giúp Nobita chinh phục đỉnh Olympia. Qua dự án này, học viên sẽ hiểu thêm về khái niệm biến trong lập trình, cách hoạt động của cấu trúc điều kiện cũng như cách đưa ra câu hỏi trong dự án. Bảo vệ đảo Bảo vệ đảo là một trò chơi mà người chơi sẽ điều khiển pháo bắn các tàu địch đang muốn tiến đến xâm chiếm 2 hòn đảo. Khi tàu bị bắn trúng tàu sẽ phát nổ và điểm sẽ được cộng cho người chơi. Qua dự án này, học viên sẽ cần sử dụng các công cụ vẽ để tạo hình khẩu pháp, bản đồ, tàu địch và các đối tượng khác. Sau bước tạo hình các nhân vật, học viên sẽ tiến hành lập trình cho từng đối tượng để các đối tượng hoạt động ví dụ: Tâm ngắm di chuột, khi tàu bị bắn trúng sẽ phát nổ, tàu hướng về phía 2 hòn đảo và di chuyển tới mục tiêu.... Thông qua khóa học, học viên sẽ hiểu được các kiến thức cơ bản trong học công nghệ thông tin như cấu trúc tuần tự, vòng lặp, cấu trúc điều kiện (cấu trúc rẽ nhánh), hàm....Ngoài ra các học viên sẽ tiếp thu thêm các kiến thức thực tiễn như các tư duy để giải quyết vấn đề, tìm và sửa lỗi sai.... Công nghệ là điều không thể thiếu trong kỷ nguyên 4.0. Thay vì ngăn cấm trẻ em sử dụng SẢN PHẨM công nghệ một cách thụ động, hãy để các em thảo sức sáng tạo ra các ứng dụng của riêng mình. Cùng Unica học ngôn ngữ lập trình ngay hôm nay để biến ý tưởng của bạn thành sản phẩm thực tế hữu dụng!"},
{"Link": "https://unica.vn/khoa-hoc-lap-trinh-dieu-khien-robot-mbot", "Name": "unica", "Title": "Khóa học lập trình điều khiển robot mBot", "GV": "Học viện VIETSTEM", "Gioithieu": "Bạn có biết rằng,  ❌ mBot là một bộ robot giáo dục dễ tiếp cận dành cho trẻ em và người mới bắt đầu học công nghệ thông tin, lập trình, điện tử và robot. ❌ mBot có thể được lập trình với cả Arduino IDE và mBlock (dựa trên nền tảng Scratch). Đây là một công cụ giáo dục tuyệt vời cho tất cả những kỹ sư tương lai.  ❌ mBot sẽ đi kèm với một phần mềm miễn phí của MakeBlock có tên là mBlock, một môi trường lập trình đồ họa kéo thả được phát triển trên nền tảng Scratch 2.0. Chúng tôi tích hợp Arduino với Scratch và thực hiện rất nhiều cải tiến. Trẻ em có thể sử dụng mBlock để kiểm soát thế giới vật chất mà không cần nối dây. >> Hãy đến với Khóa học lập trình điều khiển robot mBot tại Unica.vn Lộ trình khóa học: - Thời gian học 02 tuần tương ứng từ 12-6 video/tuần, mỗi video kéo dài khoảng 5-10 phút (tùy vào trình độ tiếp thu và thời gian học của học viên). Nội dung khóa học ✔️ Giáo trình có 57 bài giảng bao gồm 15 nội dung chính như sau: ✔️ Giới thiệu về Robot mbot và phần mềm mblock ✔️ Các kiến thức căn bản mblock ✔️ Lập trình chương trình Chuột ăn táo, dơi, bóng, khỉ… ✔️ Lập trình kiểm tra đáp án. ✔️ Điều khiển Robot ✔️ Lập trình Robot tránh vật cản ✔️ Lập trình robot đi theo đường có sẵn ✔️ Điều khiển Robot bằng điều khiển hồng ngoại... Phương pháp giảng dạy của khóa học - Học viên học tập thông qua các video và trao đổi với chuyên gia hỗ trợ trực tuyến nếu có thắc mắc. Khác biệt của khóa học ❗ Bài giảng được thiết kế theo phương thức \"Thực hành - Trải nghiệm - Trực quan\", hướng dẫn từng bước từ dễ đến khó, kết thúc mỗi chương là một sản phẩm thực tế tạo sự hứng thú cho người học. ❗ Kiến thức và các khái niệm về lập trình được lồng ghép vào từng bài gắn với từng sản phẩm từ đơn giản đến phức tạp. ❗ Không chỉ là học lập trình, khóa học muốn hướng đến việc trang bị một công cụ đa năng trợ giúp quá trình học tập và nghiên cứu các môn học khác của học sinh. Khóa học mua một lần được sở hữu trọn đời. Vậy còn chần chừ gì mà không nhanh tay đăng ký Khóa học lập trình điều khiển Robot mBot có tại Unica.vn ngay hôm nay bạn nhé !"},
{"Link": "https://unica.vn/restful-api-designing-voi-spring-boot", "Name": "unica", "Title": "RESTful API designing với Spring Boot", "GV": "Lê Quang Đạt", "Gioithieu": "Bạn có biết: Spring Boot được phát triển dựa trên Spring Framework, làm giảm bớt các cấu hình trong ứng dụng, tích hợp tự động, giúp developer chỉ tập trung vào việc phát triển business cho ứng dụng. Đó là lý do Spring Boot đang rất hot trong các khoá học ngôn ngữ lập trình Java Backend mà nhiều nhà tuyển dụng hiện nay mong muốn ứng viên của mình biết cả Spring Boot.  Khóa học RESTful API designing với Spring Boot của Lê Quang Đạt trên UNICA sẽ cung cấp kiến thức một cách hoàn chỉnh, giúp bạn làm chủ được cách design chuyên sâu cũng như implementation các ứng dụng về RESTful API. Nội dung khóa học Khóa học bao gồm 45 bài giảng và thời lượng học là 03 giờ 25 phút, mua một lần sở hữu trọn đời. Bạn sẽ nắm được những điều cơ bản về Web Services là gì, biết về SOAP Web Services, RESTful Web Services, các nguyên tắc thiết kế RESTful API, mô tả chức năng của Resources bằng http Method, thiết kế RESTful API với searching, tài liệu hóa trong thiết kế API và cách tạo REST API với Spring Boot... Ngày nay, các ứng dụng thường được thiết kế cho mục đích tái sử dụng, dễ dàng chia sẻ với các ứng dụng khác, phát triển độc lập, vì vậy nó thường chia ứng dụng lớn chia thành ứng dụng nhỏ hơn -> đó là lý do chúng ta nghĩ đến RESTful API cho mục đích thiết kế này. Mỗi ứng dụng nhỏ đó sẽ đảm nhiệm một vai trò duy nhất và sau đó có thể gọi lẫn nhau. Các ứng dụng sử dụng RESTful API: Ứng dụng cung cấp service cho hệ thống khác (tỷ giá ngoại tệ, thời tiết...), ứng dụng Mobile app, Web App SPA, hay ứng dụng dựa trên kiến trúc Microservices. Còn rất nhiều nội dung khác chuyên sâu, hãy tham khảo khóa học RESTful API designing với Spring Boot. Ngoài ra còn rất nhiều những khóa học công nghệ thông tin trên UNICA để nhận nhiều ưu đãi bất ngờ!"},
{"Link": "https://unica.vn/lap-trinh-ios-voi-swiftui", "Name": "unica", "Title": "Lập trình iOS với SwiftUI", "GV": "Nhóm giảng viên Lập Trình 0 Khó", "Gioithieu": "Các bạn thân mến,      Tại Việt Nam, lập trình viên iOS đang khá khan hiếm trong khi lượng người sử dụng các phần mềm sử dụng nền tảng iOS ngày càng tăng cao, chính vì thế mức lương của Lập trình viên iOS thường cao hơn với mức lương của các Lập trình viên khác cũng như cơ hội việc làm có sự ưu tiên hơn nhiều. Bởi vậy rất nhiều người đổ xô theo học ngôn ngữ lập trình để tìm kiếm con đường rộng mở mới      Và nếu bạn đang đi tìm cho mình một định hướng nghề nghiệp với mức thu nhập cao, cơ hội tốt thì sao bạn không thể trở thành một lập trình viên iOS? Hay bạn đã có nền tảng lập trình cơ bản nhất định và muốn định hướng theo con đường Developer iOS?  Khóa học \"Lập trình IOS với SwiftUI\" chính là lựa chọn phù hợp nhất dành cho bạn.       SwiftUI là một framework được Apple giới thiệu tại WWDC 2019, SwiftUI giúp chúng ta xây dựng App một cách đơn giản hơn. Với SwiftUI bạn chỉ cần viết một lần là có thể build cho iOS, MacOS, TvOS và cả WatchOS. Bạn có thể sử dụng SwiftUI và UIKit trong cùng một project, chúng ta sẽ viết code ít hơn và tạo ra những App tốt hơn.  Về khóa học \"Lập trình IOS với SwiftUI\"      ✔️ Đây là khóa học cung cấp cho học viên học công nghệ thông tin kiến thức lập trình iOS mới nhất của Apple đó là SwiftUI. Khoá học cung cấp cho bạn những kiến thức và kỹ năng cơ bản nhất của lập trình iOS với SwiftUI.      ✔️ Các bài giảng được trình bày một cách cô đọng từng vấn đề, giúp bạn tiết kiệm tối đa thời gian để nghiên cứu kiến thức lập trình mới của Apple và ứng dụng nhanh chóng vào dự án của mình.      ✔️ Tiếp nối thành công của bộ video lập trình iOS với UIlkit, các chuyên gia của Trung tâm đào tạo LapTrinh0Kho.com. trân trọng những phản hồi của các bạn và luôn nỗi lực để tạo ra những khoá học lập trình iOS tốt hơn. Bạn sẽ là 1 trong số những người tiên phong về SwiftUI tại Việt Nam và sẽ mở ra các cơ hội làm việc mới trong lĩnh vực phát triển App cho Apple với công nghệ mới nhất tính đến thời điểm hiện tại.      Đăng ký ngay khóa học \"Lập trình IOS với SwiftUI\"tại Unica.vn để nhanh chóng thành thạo và tự tin trở thành lập trình viên iOS chuyên nghiệp ngay tại nhà. "},
{"Link": "https://unica.vn/lap-trinh-android-nang-cao-tran-duy-thanh", "Name": "unica", "Title": "Lập trình Android nâng cao", "GV": "Trần Duy Thanh", "Gioithieu": "Nếu bạn là: Bạn là học sinh, sinh viên muốn định hướng nghề nghiệp theo học công nghệ thông tin? Bạn muốn học lập trình Java để tạo ứng dụng Android cho điện thoại? Bạn đang tốn quá nhiều thời gian cho việc học lập trình mà vẫn chưa thấy tính ứng dụng của nó? Bạn cần một lộ trình học Java bài bản, chi tiết và đầy đủ tổng hợp đầy đủ kiến thức và những kỹ thuật nâng cao? Hay bạn đã học ngôn ngữ lập trình Java, đã đi làm nhưng lại đang gặp khó khăn trong việc thiết lập Data Binding, các dữ liệu SQ Lite hay xử lý thông tin với cảm biến...? Hãy đến với khóa học \"Lập trình Android nâng cao\" tại Unica! Khóa học do giảng viên Trần Duy Thanh hướng dẫn sẽ cung cấp trọn bộ kiến thức từ cơ bản đến nâng cao của lập trình Java cũng như lập trình Android giúp học viên có thể tạo ra một ứng dụng android hoàn chỉnh, cung cấp những cơ hội thực hành tạo ứng dụng Android ngay trong quá trình học. Sau khi hoàn thành khóa học bạn sẽ có được kiến thức và kỹ năng lập trình Java cần thiết để:       ✔️ Bắt tay tự tạo ứng dụng và có thể kiếm tiền từ Google Play nhờ các ứng dụng tự tạo       ✔️ Khóa họ̣c sử dụng những công cụ, Framework mới nhất.       ✔️ Tìm hiểu cơ bản về ngôn ngữ lập trình Java (Từ định nghĩa đến kiểu dữ liệu, biến, câu lệnh, mảng, chuỗi ... cấu trúc điều khiển trong java, phương thức, lớp...)       ✔️ Cung cấp những kiến thức cốt lõi cơ bản về 1 ứng dụng android bằng cách nói về vòng đời của một ứng dụng       ✔️ Cung cấp kiến thức về thành phần cơ bản cấu thành nên ứng dụng android ( activity + intent +content provider + service)       ✔️ Hướng dẫn thực hành tạo ứng dụng android: ứng dụng quản lý, ứng dụng media, ứng dụng trên Google play       ✔️ Hướng dẫn cách kiếm tiền từ các ứng dụng trên google play        ✔️ Cung cấp một số thủ thuật cơ bản về ASO ( Cách đặt tên ứng dụng, SEO từ khóa lên top, kiếm tiền từ quảng cáo, từ số lượt tải ứng dụng ... ) Vậy còn chờ gì nữa, chinh phục khóa học \"Lập trình Android nâng cao\" ngay hôm nay tại Unica thôi!"},
{"Link": "https://unica.vn/lap-trinh-typescript-qua-project-thuc-te", "Name": "unica", "Title": "Học lập trình Typescript qua project thực tế", "GV": "Nguyễn Đức Việt", "Gioithieu": "Bạn có biết: TypeScript là một phiên bản hỗ trợ của JavaScript giúp cung cấp users option static types cũng như những tooling hữu ích và mạnh mẽ.  TypeScript giúp bạn viết ra code chuẩn và ít phải bị gặp những bug khó chịu thường thấy trong JavaScript. Không những thế TypeScript còn có tính năng thông báo và phát hiện lỗi ngay lập tức chứ không cần đợi bạn phải save file. Nhờ đó mà trải nghiệm của người dùng sẽ càng tuyệt vời hơn cũng như hiệu năng làm việc được tăng lên đáng kể…. Typescript là một dự án mã nguồn mở được Microsoft phát triển, được xem là một phiên bản nâng cao của Javascript.  Tuy nhiên: Chúng ta có rất nhiều cách để học lập trình Javascript nhanh hơn. Dù bạn học công nghệ thông tin và áp dụng theo phương pháp nào đi nữa thì bạn cần bỏ túi một số lưu ý sau: ❌ không bao giờ được lo lắng những quyết định học của mình và không được phép lao đầu học lập trình mà không nhìn lại. ❌ Thực hành các đoạn code một cách vui vẻ với những kỹ năng mới giống như một đồ chơi mới bạn muốn khám phá. ❌Tìm thời gian để code bằng việc cam kết dành cho công việc này một khoảng thời gian nhất định trong ngày. ❌ Code thật chậm, đi từng bước, thực hiện những bước nhỏ hơn, bạn sẽ học ngôn ngữ lập trình JavaScript nhanh hơn. Tuy nhiên, với những mẹo chúng ta chỉ ra bạn cần có một lượng kiến thức ổn định về JavaScript. Vây, với những bạn mới bước chân học thì việc tiếp cận việc học như thế nào? Bạn hãy tìm đến khóa học Học lập trình Javascript qua project thực tế của giảng viên Nguyễn Đức Việt trên UNICA. Khóa học đi từ phần lý thuyết cơ bản nhất một cách chi tiết, sau đó thực hành qua các bài tập, giúp bạn hiểu về Typescript, và cách để sử dụng chúng, đáp ứng nhu cầu lập trình web hiện nay của các công ty. Kết thúc khóa học bạn sẽ tự tin lập trình Typescript, tự tin đáp ứng được hết những nhu cầu cao của nhà tuyển dụng khó tính và làm được các công việc lập trình web. Hãy nhanh tay đăng ký khóa học Học lập trình Javascript qua project thực tế trên UNICA hôm nay để nhận nhiều ưu đãi!  "},
{"Link": "https://unica.vn/phuong-phap-hoc-va-ung-dung-tim-hieu-ngon-ngu-lap-trinh-kotlin", "Name": "unica", "Title": "Phương pháp học và ứng dụng tìm hiểu ngôn ngữ lập trình Kotlin", "GV": "Trương Minh Thắng", "Gioithieu": "Khoá học sẽ làm rõ các vấn đề:  - Học công nghệ thông tin là gì? Học lập trình là gì? - Phương pháp học lập trình ra sao? - Ứng dụng phương pháp học lập trình để tìm hiểu ngôn ngữ lập trình Kotlin - Những chú ý khi học ngôn ngữ lập trình Online Khoá học được dựng lại dựa trên quá trình thực tế giảng viên ứng dụng phương pháp học để tìm hiểu một ngôn ngữ lập trình mới. Các bạn sẽ  nhìn thấy những khó khăn trong quá trình học tập, và cách giảng viên suy nghĩ để vượt qua những khó khăn đó.  Sau khóa học các bạn sẽ sử dụng thành thạo ngôn ngữ lập trình Kotlin. Hiểu về những thành phần cơ bản  một ngôn ngữ "},
{"Link": "https://unica.vn/lap-trinh-android-co-ban-tran-duy-thanh", "Name": "unica", "Title": "Lập trình Android cơ bản", "GV": "Trần Duy Thanh", "Gioithieu": "Khóa học đến từ giảng viên Trần Duy Thanh cung cấp trọn bộ kiến thức từ cơ bản đến nâng cao của lập trình java cũng như lập trình android giúp học viên có thể tạo ra một ứng dụng android hoàn chỉnh sau khi hoàn thành khóa học Cung cấp những cơ hội thực hành tạo ứng dụng Android ngay trong quá trình học ngôn ngữ lập trình Sau khi hoàn thành khóa học, có thể kiếm tiền từ Google Play nhờ các ứng dụng tự tạo Khóa họ̣c sử dụng những công cụ, Framework mới nhất. Tìm hiểu cơ bản về ngôn ngữ lập trình Java (Từ định nghĩa đến kiểu dữ liệu, biến, câu lệnh, mảng, chuỗi ... cấu trúc điều khiển trong java, phương thức, lớp...). Cung cấp cho bạn kiến thức nền tảng vững chắc để học hỏi các khóa học công nghệ thông tin Cung cấp những kiến thức cốt lõi cơ bản về 1 ứng dụng android bằng cách nói về vòng đời của một ứng dụng Cung cấp kiến thức về thành phần cơ bản cấu thành nên ứng dụng android ( activity + intent +content provider + service) Hướng dẫn thực hành tạo ứng dụng android: ứng dụng quản lý, ứng dụng media, ứng dụng trên Google play Hướng dẫn cách kiếm tiền từ các ứng dụng trên google play  Cung cấp một số thủ thuật cơ bản về ASO ( Cách đặt tên ứng dụng, SEO từ khóa lên top, kiếm tiền từ quản cáo, từ số lượt tải ứng dụng ...)"},
{"Link": "https://unica.vn/java-core-lap-trinh-huong-doi-tuong-tu-zero", "Name": "unica", "Title": "JAVA CORE - Lập trình hướng đối tượng từ Zero", "GV": "Lê Quang Đạt", "Gioithieu": "Ngôn ngữ lập trình Java JAVA là ngôn ngữ lập trình website được tích hợp trong HTML để giúp website được sống động linh hoạt hơn. Ngôn ngữ Java hiện đang là ngôn ngữ lập trình phổ biến thứ hai trong các khoá học công nghệ thông tin online nhờ bởi khả năng và sự phổ biến rộng rãi. Học JAVA CORE bạn sẽ có rất nhiều hướng đi, từ lập trình Mobile app, Java web,Desktop App, Game,.. và tất cả đều sử dụng nền tảng của JAVA CORE. Thông qua khóa học \"JAVA CORE - Lập trình hướng đối tượng từ Zero\", Với những kiến thức và kinh nghiệm đã có, Giảng viên Lê Quang Đạt sẽ giúp bạn học ngôn ngữ lập trình đi từ Zero đến những kiến thức cơ bản và nâng cao của ngôn ngữ lập trình Java, bằng phương pháp giảng dạy khoa học, chuyên nghiệp và ví dụ minh họa thực tế. Kết thúc khóa học bạn sẽ :      1. Nắm được các khái niệm lập trình Java cơ bản     2. Nắm được các kiến thức về lập trình hướng đối tượng Java (OOP)     3. Kiến thức và kỹ năng xử lý dữ liệu trong Java: xử lý chuỗi trong Java, xử lý mảng, xử lý đọc - ghi file, cách setup môi trường trong Java     4. Từ kiến thức cơ bản JAVA core bạn có thể tự học các ngôn ngữ lập trình hướng đối tượng khác như C++/C#, Python,...     5. Thành thạo code Java nhanh chóng thông qua rất nhiều bài tập thực hành cụ thể, sát thực tế và lời giải đáp chi tiết, tỉ mỉ Nội dung khóa học cụ thể:  Phần 1: Giới thiệu tổng quan Phần 2: Setup môi trường lập trình Java Phần 3: Xử lý chuỗi trong JAVA Phần 4: Xử lý mảng trong JAVA Phần 5: Lập trình hướng đối tượng trong Java (OOP) Phần 6: Java Collection framework Phần 7: Xử lý ngoại lệ - Exception handling, Debugging Phần 8: Xử lý đọc- ghi file trong Java Phần 9: Những câu hỏi về JAVA Core thường gặp khi đi phỏng vấn xin việc. Tham gia khóa học \"JAVA CORE - Lập trình hướng đối tượng từ Zero\" của giảng viên Lê Quang Đạt ngay hôm nay!"},
{"Link": "https://unica.vn/lam-chu-lap-trinh-cam-nx-3-truc-co-ban-chuyen-sau", "Name": "unica", "Title": "Làm chủ Lập trình CAM NX 3 trục (Cơ bản - Chuyên sâu)", "GV": "Hoàng Quốc Duy", "Gioithieu": "Có phải bạn đang gặp rất nhiều vấn đề, chẳng hạn như... Bạn đang gặp khó khăn khi ứng tuyển vào Công ty đòi hỏi kiến thức cũng như kinh nghiệm về phần mềm Bạn muốn chinh phục CAM NX mà không biết bắt đầu từ đâu và như thế nào Có quá nhiều nguồn tài liệu, kiến thức, khoá học công nghệ thông tin online trên mạng và bạn không tìm được lựa chọn phù hợp Công việc và thời gian thì quá hạn chế, không chủ động, bạn không thể sắp xếp được thời gian đế các lớp học hay trung tâm để học CAM NX được Bạn cần một giải pháp có thể giải quyết được tất cả những vấn đề trên, một khóa học chuyên sâu về CAM NX bài bản, chi tiết, mà phải linh động thời gian cho bạn được tự do học ngôn ngữ lập trình, giúp bạn nhanh chóng làm chủ được phần mềm và ứng dụng hiệu quả nhất vào công việc của mình. Hãy đến với khóa học \"Làm chủ Lập trình CAM NX 3 trục từ cơ bản đến chuyên sâu\" tại Unica     Khóa học do giảng viên Hoàng Quốc Huy hướng dẫn sẽ giúp kỹ sư làm chủ kiến thức cũng như tư duy Lập trình Gia công CNC, ứng dụng trực tiếp vào công việc của bạn thật hiệu quả.     Bạn hoàn toàn có thể Lập trình tối ưu nhất cho các sản phẩm của khách hàng: Jig, Khuôn, chi tiết chính xác... Nội dung khóa học cụ thể      Phần 1: Tổng quan Lập trình NX CAM Manufacturing      Phần 2: Manufacturing Operation Navigator: Thao tác điều chỉnh nguyên công      Phần 3: Visualize and Analyze: Phân tích khả năng gia công      Phần 4: Geometry Groups: Xác định vùng gia công      Phần 5: Tool Groups: Cài đặt dao      Phần 6: General Milling: Khai báo điều chỉnh thông số đầu vào      Phần 7: Planar Milling: Gia công 2-2,5D      Phần 8: Drilling: Khoan 2D      Phần 9: Hole Making: Khoan 3D      Phần 10: Cavity Milling: Gia công Khuôn (Mold)      Phần 11: Templates: Tạo thư viện Gia công      Phần 12: Tạo & Hiệu chỉnh chương trình Post Builder Vậy còn chờ gì nữa hãy nhanh tay sở hữu khóa học \"Làm chủ Lập trình CAM NX 3 trục (Cơ bản - Chuyên sâu)\" cực kỳ tuyệt vời này để thay đổi hoàn toàn hiệu suất công việc của bạn, mang lại một sự nghiệp đột phá & một cuộc sống tuyệt vời."},
{"Link": "https://unica.vn/phan-tich-du-lieu-voi-numpy-pandas-va-matplotlib", "Name": "unica", "Title": "Phân tích dữ liệu với numpy, pandas và matplotlib", "GV": "Đinh Nguyễn Trọng Nghĩa", "Gioithieu": "Trong khóa học này, chúng ta sẽ sử dụng các python package để thực hiện các tác vụ phân tích dữ liệu. Cụ thể, khóa học bao gồm các phần chính như sau: Căn bản về numpy. NumPy là một thư viện Python là viết tắt của Numerical Python. Đây là thư viện cốt lõi cho scientific computing, nó chứa một đối tượng mảng n chiều mạnh mẽ. Trong phần này chúng ta sẽ học cách sử dụng numpy để tạo ta các mảng mạnh mẽ. Trong đó, chúng ta sẽ bắt đầu với cách sử dụng jupyter notebook. Sau đó, khóa học đề cập đến cách tạp và sử dụng numpy array và numpy matrix. Thao tác và phân tích dữ liệu với pandas.Pandas là một thư viện Python cung cấp các cấu trúc dữ liệu nhanh, mạnh mẽ và linh hoạt. Trong phần này, bạn sẽ được học về cấu trúc dữ liệu DataFrame, cách đọc dữ liệu từ file excel và file csv. Chúng ta cũng cùng nhau thực hiện một số tác vụ phân tích dữ liệu như Làm sạch dữ liệu, Thống kê cơ bản, Hệ số tương quan và hồi quy. Trực quan hóa dữ liệu với matplotlib: Cách vẽ các đồ thị trong python bằng gói matplotlib. Ví dụ như: đồ thị cột, đồ thị đường, đồ thị phân tán, ... Ngoài ra, bạn còn được học cách thức thực hiện các chú thích trên đồ thị và điều chỉnh sao cho đồ thị dễ nhìn, dễ quan sát hơn. Qua khóa học, bạn sẽ có cái nhìn tổng quát về phân tích dữ liệu cũng như nắm vững các công cụ mạnh mẽ được nhiều người sử dụng hiện nay trên thế giới để thực hiện các tác vụ phân tích dữ liệu."},
{"Link": "https://unica.vn/cau-truc-du-lieu-va-giai-thuat-tap-1", "Name": "unica", "Title": "Cấu Trúc Dữ Liệu và Giải Thuật- Tập 1", "GV": "Trần Duy Thanh", "Gioithieu": "Có phải bạn đang: - Học sinh, sinh viên, học viên muốn tự tìm hiểu cấu trúc dữ liệu và giải thuật - Bạn chưa biết gì về cấu trúc dữ liệu và giải thuật, yêu thích lập trình ngôn ngữ C++  - Bạn cần một lộ trình học công nghệ thông tin tại nhà đầy đủ, chi tiết  và bài bản từ người có kinh nghiệm thực chiến lâu năm trong nghề để hỗ trợ bạn trong quá trình học Vậy thì bạn không nên bỏ qua khóa học \"Cấu Trúc Dữ Liệu và Giải Thuật\" của giảng viên Trần Duy Thanh! Khóa học \"Cấu trúc dữ liệu và giải thuật\" có gì dành cho bạn? Cung cấp những cơ hội thực hành tạo ứng dụng CTD và Giải thuật với C++ ngay trong quá trình học Sau khi hoàn thành khóa học, học viên sẽ có kiến thức để tiếp tục học các môn khác nhau: Python, lập trình Java, lập trình Android, C#... Cài đặt cấu trúc dữ liệu và giải thuật bằng C++ Hàm và đệ quy Các giải thuật tìm kiếm: Tuyến tính, nhị phân Các giải thuật sắp xếp: Bubble Sort, selection sort , quick sort... Danh sách liên kết: Đơn, đôi Stack và Queue Tree: Cây nhị phân tìm kiếm Cơ bản về đánh giá giải thuật Những lợi ích khi học Online tại Unica: Mua 1 lần sở hữu TRỌN ĐỜI. HỌC ONLINE mọi lúc mọi nơi trên mọi thiết bị (điện thoại, laptop,pc). TƯ VẤN hỗ trợ 24/7 từ chuyên gia. Được HOÀN TIỀN trong vòng 7 ngày nếu không hài lòng về khóa học. Vậy còn chờ gì nữa, tham gia khóa học \"Cấu Trúc Dữ Liệu và Giải Thuật\" ngay hôm nay chỉ có tại Unica! "},
{"Link": "https://unica.vn/xay-dung-rest-api-service-voi-node-va-express", "Name": "unica", "Title": "Xây dựng REST API Service với Node và Express", "GV": "Phan Văn Luân", "Gioithieu": "Bạn có biết: REST là cụm từ viết tắt của REpresentational State Transfer, nó là một dạng chuyển đổi cấu trúc dữ liệu, là một phong cách kiến trúc cho việc thiết kế các ứng dụng có kết nối với nhau. Nó sử dụng HTTP đơn giản để tạo cho giao tiếp các máy. Vì vậy, thay vì sử dụng một URL để xử thông tin, chúng ta chỉ cần sử dụng REST gửi yêu cầu HTTP như GET, POST, DELETE đến một URL để xử lý dữ liệu. API (Application Programming Interface) là giao diện lập trình ứng dụng giúp tạo ra các phương thức kết nối với các thư viện và ứng dụng khác nhau. Và, như vậy, REST API là một ứng dụng  chuyển đổi cấu trúc dữ liệu có các phương thức để kết nối với các thư viện và ứng dụng. Nó không được xem là công nghệ, nó chỉ là một giải pháp để tạo ra các ứng dụng web services thay thế. Như vậy: Muốn nắm chắc các kiến thức về REST, áp dụng  Javascript vào thực tế được thì bạn cần phải được học công nghệ thông tin một cách bài bản và chuyên nghiệp. Chính vì thế, khóa học Xây dựng REST API Service với Node và Express của giảng viên Phan Văn Luân trên UNICA sẽ  giúp bạn nắm được kiến thức về REST. Khóa học bao gồm 30 bài giảng và thời lượng học là 02 giờ 28 phút. Đây là một khóa học hướng dẫn rất cơ bản, chi tiết và đầy đủ, ngắn gọn các kiến thức các bạn cần biết để xây dựng được một REST API service. Khóa học áp dụng các cú pháp Javascript ES6 mới để các bạn có thể nắm được xu hướng và kĩ thuật mới của Javascript trong những năm gần đây được ứng dụng như thế nào. Kết thúc khóa học bạn sẽ xây dựng được REST API hoàn chỉnh trên nền Node và ExpressJS. Không chỉ vậy, khóa học còn đem đến cho bạn nhiều kĩ năng mới cần được bổ sung và phát huy trong quá trình phát triển sản phẩm như sử dụng công cụ lập trình một cách nhạy bén, hiệu quả; hay quản lý việc kiểm thử các Rest API một cách gọn gàng và nhanh chóng… Hãy nhanh tay đăng ký khóa học Xây dựng REST API Service với Node và Express ngay hôm nay trên UNICA. Chắc chắn các bạn sẽ cảm thấy thích thú và học hỏi được nhiều kinh nghiệm trong khóa học này."},
{"Link": "https://unica.vn/lap-trinh-game-3d-voi-unity", "Name": "unica", "Title": "Lập trình game 3D với Unity", "GV": "Trương Nguyễn Hoàng Long", "Gioithieu": "Có phải bạn là...  Yêu thích game và muốn trở thành người lập trình sáng tạo nên trò chơi của mình Bạn là người đã có hiểu biết về Unity 3D và muốn nâng cao kỹ năng lập trình game. Hay bạn chưa biết và mong muốn tìm hiểu về Unity 3D Bạn đã có kiến thức lập trình, muốn học và trải nghiệm lập trình game 3D Bạn yêu thích học công nghệ thông tin chuyên về lập trình Chào mừng các bạn đã đến với khóa học \"Lập trình game 3D với Unity\", của giảng viên Trương Nguyễn Hoàng.  Khóa học unity đặc biệt dành cho những người đã biết hoặc đã có những trải nghiệm nhất định về Unity - phần mềm làm game đa nền tảng phổ biến nhất, hay những người đã có kỹ năng lập trình và muốn chuyển sang mảng lập trình game. Sau khóa học, bạn sẽ có kiến thức lập trình game với Unity 3D, cải thiện kỹ năng lập trình, và có thể tự tay lập trình được 1 game 3D theo hướng dẫn. Tham gia khóa học lập trình game unity bạn sẽ được thầy Hoàng hướng dẫn:       ✔️ Kiến thức và những kỹ năng cơ bản đầu tiên cần có để bắt tay lập trình game       ✔️ Hướng dẫn thực hiện lập trình trnag thái game, chướng ngại vật và di chuyển nhân vật từ đơn giản cho đến mượt mà bằng camera       ✔️ Lập trình hiển thị màn hình game theo từng trường hợp: lúc vào game, game over, màn hình trong game,... và lập trình âm thanh Optimize       ✔️ Lập trình concept game: thông tin người chơi, điểm, nhiệm vụ...       ✔️ Hướng dẫn lập trình nhân vật, bối cảnh và tối ưu khung hình sao cho phù hợp: về màu sắc, ánh sáng, hiệu ứng, ... để game có độ chân thật cao hơn       ✔️ Cách kiểm thử game trên thiết bị thật, check lỗi và fix. Đồng thời hướng dẫn học viên đóng gói file cài đặt, up sản phẩm lên Google Play để công khai trò chơi. Vậy còn chờ gì nữa, chinh phục khóa học \"Lập trình game 3D với Unity\" ngay hôm nay tại Unica thôi!"},
{"Link": "https://unica.vn/ky-nang-co-ban-de-tro-thanh-ky-thuat-vien-it-ngan-doanh-nghiep-can", "Name": "unica", "Title": "Kỹ năng cơ bản để trở thành kỹ thuật viên IT - Ngàn doanh nghiệp cần", "GV": "Trần Đắc Tốt", "Gioithieu": "Bạn có biết: IT là từ viết tắt của Information Technology nghĩa là công nghệ thông tin. IT chính là việc làm liên quan tới phần mềm máy tính, kiểm soát hiệu quả hệ thống máy tính và phục vụ một số nhu cầu trong công việc khác nhau liên quan đến công nghệ. Hiện nay, hầu hết các công ty đều cần đến bộ phận IT để hỗ trợ công việc của mình. Vì vậy, việc làm IT đang trở thành công việc có nhu cầu tuyển dụng rất cao.  Do nhu cầu tuyển dụng cao nên mức lương dành cho các bạn nhân viên IT cũng rất cao. Tuy nhiên, bên cạnh đó thì yêu cầu về kinh nghiệm và kỹ năng cũng rất cao. Cụ thể: ✔️ Có niềm đam mê công nghệ ✔️ Suy nghĩ logic ✔️ Đam mê học công nghệ thông tin ✔️ Có tinh thần làm việc nhóm ✔️Kiên nhẫn Chính vì thế, khóa học Kỹ năng cơ bản để trở thành kỹ thuật viên IT - Ngàn doanh nghiệp cần của giảng viên Trần Đắc Tốt trên UNICA sẽ  trang bị cho học viên các kiến thức về học IT cơ bản về máy tính, các thao tác thực hành giúp các bạn có thể quản lý máy tính một cách tối ưu nhất có thể. Nội dung khóa học Khóa học kỹ thuật viên máy tính bao gồm 39 bài giảng và thời lượng học là 07 giờ 40 phút. Khóa học này giúp cho các bạn tự tin khắc phục được các sự cố máy tính, khai thác internet một cách hiệu quả và biết trang bị kiến thức về công nghệ.  Ngoài ra, khóa học còn cung cấp cho bạn: * Cách lựa chọn mua máy tính tiết kiệm chi phí nhất * Cài đặt một hệ thống máy tính hoàn chỉnh * Sử dụng và làm chủ hệ điều hành Windows 10 * Khai thác tiện ích và xử lý các sự cố thông dụng * Kết nối Internet cho máy tính * Hướng dẫn tạo mail và lưu trữ dữ liệu an toàn * Hướng dẫn cứu dữ liệu do xóa nhầm * Tìm kiếm và sàng lọc thông tin an toàn và hiệu quả * Lắp đặt mạng Wifi/Internet cho gia đình và quán Café, VP công ty - Với lượng kiến thức tối ưu mà khóa học mang đến, còn chần chừ gì nữa mà không nhanh tay đăng ký khóa học \"KỸ NĂNG CƠ BẢN ĐỂ TRỞ THÀNH KỸ THUẬT VIÊN IT, NGÀN DOANH NGHIỆP CẦN\" của Giảng viên - Th.S Trần Đắc Tốt."},
{"Link": "https://unica.vn/lap-trinh-backend-cho-website-bang-php-mysql-theo-mo-hinh-mvc", "Name": "unica", "Title": "Lập trình Backend cho website bằng PHP/Mysql theo mô hình MVC", "GV": "Nguyễn Đức Việt", "Gioithieu": "Điểm khác biệt của khóa học \"Lập trình Backend cho website bằng PHP/Mysql theo mô hình MVC\" này so với các khóa học online khác cùng chủ đề lập trình PHP là gì vậy? Khác người trình bày bạn ạ. Mình nghĩ cũng ảnh hưởng một phần đó, mỗi người một cách trình bày và tiếp cận khác nhau, sẽ hợp với từng người khác nhau, hi vọng bạn và mình \"tương thích\". Hơn nữa mình tự tin ở phần là rất chi tiết, mình nghĩ là không ai nói chi tiết như thế bạn ạ, để đảm bảo là bạn hiểu tận ngóc ngách và bản chất của vấn đề. Einestern đã nói là nếu bạn không thể giải thích cho một đứa trẻ hiểu thì bạn cũng chẳng hiểu rõ vấn đề. Bạn thử học ngôn ngữ lập trình nhé! Tham khảo qua nội dung khóa học của mình     Phần 1: Cài đặt công cụ lập trình     Phần 2: Cài đặt môi trường và kiến trúc MVC     Phần 3: Ứng dụng MVC đầu tiên     Phần 4: Học Mysql tạo cơ sở dữ liệu và kết nối     Phần 5: Hoàn thiện dự án đầu tiên với MVC và Mysql     Phần 6: Giới thiệu về dữ liệu kiểu mảng     Phần 7: Bài toán kinh điển - Lập trình thêm + sửa + xóa dữ liệu với PHP-Mysql     Phần 8: Học PHP Mysql qua bài số 2 - quản lý nhân sự     Phần 9: Thiết kế dữ liệu và thiết kế frontend bằng bootstrap 4     Phần 10: Lập trình chức năng thêm dữ liệu     Phần 11: Lập trình chức năng sửa và xóa dữ liệu     Phần 12: Viết jquery cho Frontend load dữ liệu mà ko cần load lại trang     Phần 13: Kiểu dữ liệu hiện đại - JSON     Phần 14: Hiểu bản chất của json thông qua làm một web hoàn chỉnh     Phần 15: Đưa Json vào lập trình backend     Phần 16: Chức năng thêm mởi slide ảnh dùng Json     Phần 17: Hoàn thiện Backend cho phần slide     Phần 18: Hoàn thiện Frontend cho phần slide     Phần 19: Tổng kết khóa học và các kiến thức sẽ học phần nâng cao Mình tin rằng với nội dung khóa học lập trình web online chi tiết như vậy sau khi kết thúc khóa học bạn hoàn toàn có thể nhanh chóng trở thành một lập trình viên Backend bằng PHP, MySQL cho website, tự tin với khả năng của mình ứng tuyển vào các vị trí Dev backend tại các công ty, hoặc học cao hơn lên lập trình Fullstack ngay tại nhà. Hãy để mình đồng hành cùng các bạn trong khóa học \"Lập trình Backend cho website bằng PHP/Mysql theo mô hình MVC\" cùng Nguyễn Đức Việt này nhé. Ngoài ra còn rất nhiều những khoá học công nghệ thông tin online khác trên Unica đang chờ bạn khám phá. Let's go! Quà tặng khi mua khóa học tại Unica.vn: Tặng Miễn Phí HOSTING TỐC ĐỘ CAO tại INET.VN trong 30 ngày"},
{"Link": "https://unica.vn/hoc-lap-trinh-web-css3-co-ban-va-nang-cao", "Name": "unica", "Title": "Học CSS 3 cho người mới bắt đầu", "GV": "Đặng Văn Lel", "Gioithieu": "Thiết kế web bằng CSS3 có gì đặc biệt? HTML, CSS và JavaScript là bộ 3 ngôn ngữ bắt buộc cần phải thuần thục của một lập trình viên ứng dụng Web. Với bộ 3 ngôn ngữ này, một lập trình viên có thể thiết kế, xây dựng một ứng dụng Web từ đơn giản đến phức tạp.  Và, HTML5 và CSS3 đang được rất nhiều anh em lập trình viên sử dụng rất rộng rãi trong công việc học lập trình web và thiết kế web doanh nghiệp hoặc cá nhân. CSS3 là gì? Cascading Style Sheets (CSS) là những file hỗ trợ trình duyệt web trong việc hiển thị một trang HTML. Các file CSS sẽ giúp cho thiết kế web được cụ thể hóa các thành phần của trang HTML nên được hiển thị như thế nào, nó cho phép bạn kiểm soát phông chữ, màu nền, kiểu nền… CSS3 giúp cho việc thiết kế và xây dựng trang web trở lên vô cùng dễ dàng hơn. Việc thay đổi trạng thái của một trang web đơn giản hơn khi bạn chỉ cần thay đổi trong một file CSS là đã có thể thực hiện sự thay đổi này trên toàn bộ trang web. CSS3 là thế hệ mới nhất của CSS hỗ trợ rất nhiều tính năng mới. Nhưng: Để làm quen được các file hỗ trợ trình duyệt web CSS3 này thì bạn cần học công nghệ thông tin và nắm vững các kiến thức chuyên ngành liên quan đến lập trình. Khóa học Học lập trình Web - CSS3 cơ bản và nâng cao của giảng viên Đặng Văn Lel trên UNICA  sẽ cung cấp kiến thức cần thiết cho bạn về CSS3. Khóa học bao gồm 15 bài giảng và thời lượng học là 05 giờ 49 phút. Khóa học này sẽ cung cấp cho học viên những kiến thức cơ bản, cần thiết nhất để bắt đầu trên con đường trở thành một lập trình viên ứng dụng Web chuyên nghiệp. CSS là những kiến thức cơ bản cần trang bị trước khi tiếp cận với các công nghệ, nền tảng lập trình Web hiện đại như ASP.NET, PHP… Hãy nhanh tay đăng ký khóa học Học lập trình Web - CSS3 cơ bản và nâng cao trên UNICA ngay hôm nay!"}
]