[
{"Link":"https://careers.smartosc.com/job/thuc-tap-sinh-dao-tao-2/", "LawName":"Thực tập sinh Đào tạo", "title":"Job Description","Answer":"1. Hỗ trợ công tác đào tạo – Hỗ trợ xác định nhu cầu đào tạo, lập kế hoạch tổ chức các khóa đào tạo, điều phối lớp học bao gồm chuẩn bị hậu cần trước, trong và sau giờ học Hỗ trợ theo dõi và báo cáo các khóa đào tạo, đề xuất ý tưởng giúp cải tiến hoạt động đào tạo của Công ty Trợ giảng cho các giảng viên, tổ chức các sự kiện nội bộ liên quan đến đào tạo 2. Hỗ trợ công tác phát triển tổ chức  Hỗ trợ công tác ban hành các văn bản phân quyền ủy quyền  Hỗ trợ cập nhật cơ cấu tổ chức, chức năng nhiệm vụ các Khối/Ban  Hỗ trợ các công tác xây dựng hệ thống đánh giá công việc, khung năng lực chuyên môn, kế hoạch phát triển, chương trình innovation… 3. Một số công việc khác được giao từ người hướng dẫn trực tiếp Requirements Sinh viên năm cuối hoặc mới tốt nghiệp theo học các ngành Kinh tế, Tài chính, Quản trị nhân lực… Thông minh, nhanh nhẹn, cẩn thận, có đam mê mảng đào tạo và phát triển Kỹ năng tin học văn phòng tốt: sử dụng excel,world, powerpoint. Ưu tiên các bạn thành thạo tiếng anh Có thể làm việc full-time (5 ngày/tuần). Benefits Trợ cấp lương hàng tháng hấp dẫn Trải nghiệm thực tế ở doanh nghiệp IT hàng đầu Việt Nam có quy mô 1000 nhân sự Được trao cơ hội thể hiện năng lực bản thân, sáng tạo và đóng góp ý tưởng/sáng kiến/… Được hướng dẫn, đào tạo kỹ năng liên quan đến nghề Nhân sự Tham gia các chương trình đào tạo, khóa huấn luyện nội bộ; tham gia các sự kiện công nghệ, hoạt động phong trào, …."},
{"Link":"https://www.internship.edu.vn/jobs/thuc-tap-sinh-lap-trinh-net-c-blazor-2024/", "LawName": "Thực tập sinh lập trình .Net, C#, blazor 2024", "title":"Job Overview","Answer":"1. Mô tả công việc Job description Làm project thực tập của công ty bằng Blazor, C# + SQL Server theo cách lập trình tự do Theo các anh chị xuống kho để học các qui trình, viết tóm tắt lại những gì mình học trong quá trình xuống kho. Trong quá trình thực tập, một thực tập sinh phải xuống kho ít nhất 8 lần.Làm lại project thực tập của công ty bằng kiến trúc, nền tảng của công ty."},
{"Link":"https://123job.vn/viec-lam/tuyen-thuc-tap-sinh-phap-ly-vrzBV1M0r0?codePosition=C1","LawName": "Tuyển Thực tập sinh Pháp lý","title":"Mô tả công việc","Answer":"Nghiên cứu văn bản, cơ sở pháp lý, cập nhật các nội dung liên quan đến quy định pháp luật Soạn thảo các loại Hợp đồng, thư từ, chứng từ, tài liệu. Hỗ trợ các Luật sư và chuyên gia trong quá trình tham gia vào các vụ việc pháp lý cụ thể; Liên hệ với các cơ quan có thẩm quyền để thực hiện các công việc hành chính;Thực hiện các công việc khác liên quan theo yêu cầu"},
{"Link":"https://viecoi.vn/viec-lam/thuc-tap-sinh-marketing-co-luong-71100.html","LawName": "VIỆC LÀM THỰC TẬP SINH MARKETING CÓ LƯƠNG tại TPHCM - Mtv Wacontre","title":"Mô tả công việc","Answer":"NỘI DUNG CÔNG VIỆC Kế hoạch nội dung, hình ảnh cho fanpage mỗi tuần Quản lý các trang mạng xã hội Tham gia báo cáo công việc hàng tuần, hàng quý Hỗ trợ chăm sóc khách hàng trên các trang mạng xã hội Hỗ trợ các công việc admin website Hỗ trợ viết bài viết chuẩn SEO, viết blog, ebook Có thể tham gia trực tiếp vào các dự án của công ty theo định hướng công việc"},
{"Link":"https://jobsgo.vn/viec-lam/it-communicator-tieng-nhat-n1-17133968621.html?utm_source=Indeed&utm_medium=organic&utm_campaign=Indeed%E2%80%A8","LawName": "IT Communicator (Tiếng Nhật N1)","title":"Mô tả công việc","Answer":"Công ty Nhật Bản làm về Công nghệ Marketing (Marketing Technology - MarTech), sử dụng DATA và CÔNG NGHỆ để hỗ trợ cho hoạt động Marketing của các công ty trên toàn thế giới. 80% đơn hàng từ Công ty mẹ Lương:25,000,000 ~ 40,000,000 VND(GROSS)Nội dung công việc: Phiên dịch tiếng Nhật tại cuộc họpDịch tài liệu tiếng Nhật Tham gia vào dự án phát triển hệ thống Làm người điều hành cuộc họp- Soạn thảo tài liệuThực hiện các nhiệm vụ khác với liên kết với các kỹ sưĐịa chỉ: Quận 3, Tp Hồ Chí MinhThời gian làm việc:8:00-17:30 từ thứ 2-thứ 6 (nghỉ trưa từ 12:00-13:30)*Ngày nghỉ:Thứ 7, Chủ nhật"}
]
