[
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-cham-soc-khach-hang-tu-van-san-pham.35BF8C4B.html", "Position": "Nhân viên chăm sóc khách hàng-tư vấn sản phẩm", "Location": "Hà Nội", "Salary": "8 Tr - 20 Tr VND", "DeadlineSummit": "31/03/2024", "Detail": "", "Require": "- Ưu tiên ứng viên kinh nghiệm làm việc ít nhất 1 năm làm trong lĩnh vực dịch vụ, chăm sóc khách hàng (Spa, dịch vụ chăm sóc sức khỏe, F&B...) và có lối sống hay thói quen lành mạnh- Kĩ năng giao tiếp, lắng nghe, biết nắm bắt tâm lý khách hàng.- Có trách nhiệm trong công việc, xử lý tình huống linh hoạt.- Thành thạo vi tính văn phòng (Word/ Excel)   "},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/tp-kinh-doanh-dich-vu-van-tai-van-chuyen-hanh-khach.35BF8D12.html", "Position": "TP. Kinh doanh Dịch vụ vận tải (vận chuyển hành khách)", "Location": "Hà Nội", "Salary": "30 Tr - 40 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "- Xây dựng kế hoạch kinh doanh, chính sách kinh doanh, ngân sách kinh doanh và chỉ tiêu kinh doanh theo từng tháng, quý, năm trình Ban Giám đốc phê duyệt. Thực hiện và kiểm soát thực hiện cũng như chịu trách nhiệm về các chỉ tiêu đã nhận.- Đề xuất các giải pháp, chính sách, các chương trình marketing … để nâng cao hiệu quả hoạt động kinh doanh.- Thiết lập danh mục khách hàng đã có, khách hàng mới và khách hàng tiềm năng. Thực hiện công tác chăm sóc khách hàng trước, trong và sau khi sử dụng dịch vụ.- Tổ chức thu thập, phân tích, đánh giá thông tin thị trường, đối thủ cạnh tranh và đưa ra đề xuất, kiến nghị thay đổi kế hoạch kinh doanh cho phù hợp với từng thời điểm.- Quản lý các hoạt động kinh doanh của Phòng đảm bảo tuân thủ đúng theo quy định của Công ty và Luật pháp Việt Nam.- Chịu trách nhiệm tính giá cho các HĐ mới, chủ trì trong công tác làm hồ sơ thầu.- Đàm phán với khách hàng về các sự vụ phát sinh, tăng, giảm chi phí hoặc thay đổi các điều khoản trên HĐ. - Báo cáo với lãnh đạo về kết quả hoạt động trong tháng/quý/ năm theo quy định báo cáo của Công ty.- Tổng kết lại những kết quả, phân tích chỉ tiêu kinh doanh theo từng tháng từng Hợp đồng để từ đó xem xét và đánh giá chất lượng sản phẩm/dịch vụ của Phòng nhằm đưa ra những phương án kinh doanh tối ưu nhất.- Kiểm soát quá trình đàm phán, ký HĐ, kiểm soát các điều khoản trên HĐ để đảm bảo các yếu tố về giá trị, tài sản, pháp lý khi ký kết với Khách hàng, đối tác. Kiểm soát các văn bản (bản cứng, bản mềm) của Phòng khi trình Ban Giám đốc Công ty, cùng với PP. KD DVVT chịu trách nhiệm trước Ban Giám đốc Công ty về thể thức trình bày và nội dung của văn bản.- Kết hợp với Phòng TCHCNS & QT trong việc tuyển dụng, đào tạo, nâng cao kỹ năng, nghiệp vụ cho CBNV Phòng KD DVVT/ TT CSXH.- Kết hợp với Phòng TCHCNS & QT trong việc xây dựng các quy trình làm việc để kiện toàn bộ máy kinh doanh của Phòng KD DVVT/ TTCSXH.- Quản lý, giám sát, điều hành, duy trì và phát triển hoạt động của Phòng KD DVVT.- Thực hiện công tác đào tạo lái xe, đào tạo nhân sự các Bộ phận thuộc phòng KD DVVT.-Trực tiếp thực hiện các công việc giám sát hành trình, điều hành xe, lái xe theo yêu cầu thực tế của công việc.", "Require": ""},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/cua-hang-truong-kinh-doanh-xang-dau.35BF8D05.html", "Position": "Cửa hàng trưởng (Kinh doanh Xăng dầu)", "Location": "Hà Nội", "Salary": "10 Tr - 15 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": ":- Quản lý và chịu trách nhiệm toàn bộ đến hoạt động bán hàng của Cửa hàng Xăng dầu.- Chịu trách nhiệm phân công công việc (chia ca, luân chuyển…) để đảm bảo công việc được vận hành trôi chảy; giám sát thực hiện quy trình làm việc; giám sát việc thực hiện Nội quy, Quy chế, Quy định của CBNV Cửa hàng Xăng dầu.- Chịu trách nhiệm nhập hàng, thực hiện đúng quy trình nhập hàng, vào sổ sách theo dõi kho hàng. Đối với những trường hợp nhập hàng ngoài khung giờ làm việc phải sắp xếp nhân sự nhập hàng để đảm bảo tính an toàn và đủ hàng hóa cho cửa hàng hoạt động. Kiểm soát số lượng nhập, xuất, tồn kho xăng, dầu của Cửa hàng.- Phát triển hệ thống khách hàng nhằm tăng doanh thu cho cửa hàng.- Kiểm soát tài chính: thu, chi, công nợ…của Cửa hàng đảm bảo theo quy định của Công ty; Kiểm tra hóa đơn xuất ra cho khách lẻ trước khi chuyển lên Phòng TCKT.- Lập kế hoạch làm việc tuần và báo cáo công việc tuần lên TP KDXD vào Thứ bảy hàng tuần. Và các Kế hoạch, báo cáo đột xuất theo yêu cầu của Cửa hàng và BGĐ.-Kết hợp với Ban An Ninh đảm bảo về công tác phòng chống cháy nổ, an toàn lao động, an ninh trật tự trong ca làm việc.- Trực tiếp xử lý các tình huống phát sinh tại cửa hàng hoặc báo cáo cho cấp Quản lý trực tiếp để xin ý kiến chỉ đạo.- Rút kinh nghiệm các sự vụ, đào tạo nhân viên tránh lỗi tái lặp. Giám sát / quản trị các vấn đề gian lận trục lợi.- Quản lý trang thiết bị tài sản máy móc. Đề xuất sửa chữa kịp thời khi xảy ra hỏng hóc làm ảnh hưởng tới công tác bán hàng.- Thực hiện công tác báo cáo định kỳ hoặc đột xuất theo quy định của Công ty.- Lan tỏa hình ảnh, thương hiệu, sản phẩm của công ty tới cộng đồng- Hỗ trợ các bộ phận khác- Thực hiện các công việc khác theo yêu cầu.", "Require": "- Tốt nghiệp đại học hoặc cao đẳng trở lên.- Ưu tiên có kinh nghiệm làm việc trong lĩnh vực chuyên môn từ 2 năm trở lên.- Am hiểu các điều luật liên quan đến Môi trường, PCCC và các quy định về xăng dầu của nhà nước.- Am hiểu công tác quản lý Phòng KD XD.- Có kiến thức về lĩnh vực hoạt động sản xuất kinh doanh của Công ty.- Nắm vững các quy trình làm việc của Công ty.- Kỹ năng tổ chức, giám sát công việc.- Kỹ năng phân tích, tổng hợp và làm báo cáo.- Kỹ năng Tin học văn phòng thành thạo."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/trade-officer-chuyen-vien-thuong-mai-japanese-speaking-2.35BF8B52.html", "Position": "TRADE OFFICER/ CHUYÊN VIÊN THƯƠNG MẠI - JAPANESE SPEAKING (2)", "Location": "Hồ Chí Minh", "Salary": "15 Tr - 30 Tr VND", "DeadlineSummit": "31/03/2024", "Detail": "", "Require": "1.      2.      Having economic background;3.      Need skills and a good sense of researching new products and/or merchandise;4.      Preferably, have an experience in purchasing/ merchandising/ sales/ import-export-trading business;5.      Preferably, be able to use English;6.      IT competent (office suite, email, internet searching);7.      Be able to work to deadlines;8.      Ability to work independently, hard-working with can-do attitude.9.      Follow management’s instructions;10.    Work well with others;"},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/truong-phong-ke-hoach-dau-tu.35BF8D00.html", "Position": "Trưởng phòng Kế hoạch &Đầu tư", "Location": "Hà Nội", "Salary": "30 Tr - 40 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "", "Require": ""},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/content-marketing.35BF8D43.html", "Position": "Content Marketing", "Location": "Hà Nội", "Salary": "6 Tr - 9 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "", "Require": "1. Tốt nghiệp Cao đẳng trở lên các ngành về  Marketing, Wedsite các ngành liên quan.2. Có ít nhất 02 năm kinh nghiệm ở vị trí tương đương.3. Thành thạo vi tính văn phòng Microsoft, các ứng dụng xử lý đồ; Photosho, Adobe Illustrator, AI, Indesign.4. Năng động, nhiệt tình, kiên trì, chịu khó, có khả năng chịu được áp lực và cường độ cao trong công việc."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-telesales.35BF8C7D.html", "Position": "Nhân viên Telesales", "Location": "Hà Nội", "Salary": "10 Tr - 25 Tr VND", "DeadlineSummit": "10/03/2024", "Detail": "- Tiếp nhận KPI cá nhân từ trưởng phòng và lên kế hoạch thực hiện- Tiếp nhận Data MKT và các nguồn khác để tư vấn các sản phẩm, liệu trình sử dụng các dịch vụ tạịThẩm mỹ Viện, chăm sóc cho Kh có nhu cầu.- Hỗ trợ giải quyết, chăm sóc KH sau khi sử dụng dịch vụ.- Thực hiện các công việc khác theo yêu cầu của Quản lý.", "Require": "- Có kinh nghiệm từ 06 tháng tại vị trí Telesale trở lên- Có kỹ năng giao tiếp và thuyết phục tốt, giọng nói dễ nghe.- Xử lý các tình huống và nắm bắt tâm lý khách hàng tốt.- Cầu tiến và có trách nhiệm cao trong công việc.- Có laptop cá nhânLợi thế ứng tuyển:• Có kinh nghiệm làm việc tại mảng làm đẹp: Thẩm mỹ, nha khoa, ...• Yêu thích cái đẹp và muốn phát triển sự nghiệp trong ngành làm đẹp.• Thích kiếm tiền nhiều tiền, ham học hỏi và máu lửa với công việc.Thu nhập: LCB 6tr + phụ cấp 780k + KPI + thưởng. Thu nhập 15tr – 30trMôi trường chuyên nghiệp, năng động, thân thiện, có cơ hội thăng tiến tốt.Hưởng niềm vui chứ không chỉ phúc lợi: Sinh nhật hàng tháng, chế độ lễ, tết, hiếu, hỷ"},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-thiet-ke.35BF8D0D.html", "Position": "Nhân viên thiết kế", "Location": "Hà Nội", "Salary": "13 Tr - 15 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "1. Trao đổi ý tưởng thiết kế với quản lý và sản phầm đảm bảo thời gian, tiến độ công việc, sản phẩm thiết kế của mình được giao.2. Thiết kê nội thất văn phòng, showroom, gian hàng triển lãm khi được yêu cầu.3. Tìm kiếm và phụ trách làm việc với các đơn vị in ấn, nhà thầu thi công các hạng mục quảng cáo.4. Thực hiện và hoàn thành các công việc khác do BGĐ, Trưởng bộ phận yêu cầu.5. Chịu trách nhiệm thiết kế đồ họa và giám sát in ấn các sản phẩm mang tính chất nhận diện thương hiệu như logo công ty, card, catalogue, brochure sản phẩm, phong bì nhãn mác công ty, tem dán logo.6. Đưa ra các ý tưởng và thiết kế các biển bảng quảng cáo, banner, quảng cáo online, backdrop,...7. Thiết kế poster, tờ rơi,...chiến dịch quảng cáo, sản phẩm in ấn để phục vụ cho việc quảng bá dịch vụ.", "Require": "1. Tốt nghiệp Cao đẳng trở lên các ngành về Thiết kế, đồ họa, Wedsite các ngành liên quan.2. Có ít nhất 02 năm kinh nghiệm ở vị trí tương đương.3. Thành thạo vi tính văn phòng Microsoft, các ứng dụng xử lý đồ; Photosho, Adobe Illustrator, AI, Indesign.4. Năng động, nhiệt tình, kiên trì, chịu khó, có khả năng chịu được áp lực và cường độ cao trong công việc.5. Khả năng giao tiếp, làm việc độc lập và làm việc nhóm tốt.6. Có kỹ năng xử lý tình huống tốt, kỹ năng phân tích yêu cầu công việc.7. Kỹ năng lập kế hoạch, tổ chức công việc. "},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/truong-phong-kinh-doanh-linh-vuc-xang-dau.35BF8D02.html", "Position": "Trưởng Phòng Kinh Doanh (Lĩnh vực Xăng Dầu)", "Location": "Hà Nội", "Salary": "25 Tr - 30 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "1.Chịu trách nhiệm sản lượng bán hàng của năm, doanh thu và các chỉ tiêu lợi nhuận (Các Cửa hàng xăng dầu)2. Chịu trách nhiệm các công việc có liên quan đến Bộ phận mình quản lý cho Kế Hoạch Kinh Doanh Hàng Năm của Công ty3. Phát triển chuyên môn để đưa ra các chiến lược kinh doanh hiệu quả cho từng thời điểm.4.Tổ chức việc khen thưởng thành tích hoặc kỷ luật lao động đối với CBNV trong Phòng; Thường xuyên tổ chức các cuộc họp cải tiến để thúc đẩy năng lực quản lý; thiết lập các mục tiêu nhằm mục đích tăng cường thành tích; đề xuất đào tạo nhằm phát triển năng lực cá nhân của nhân viên.5. Giám sát các chi phí hoạt động và Ngân Sách chi tiêu của Phòng, điều phối các dự án cải thiện năng suất làm việc để thúc đẩy hoạt động kinh doanh của Phòng.- Thường xuyên xem xét các báo cáo bán hàng và các hồ sơ/tài liệu quan trọng, phân tích kết quả dựa trên các dữ kiện và số liệu có được, định ra các cơ hội và đặt ra các ưu tiên dựa trên những gì có khả năng đạt mục tiêu kinh doanh cao nhất, nhận dạng các nhân viên thuộc quyền cần sự chỉ đạo ngay lập tức và/hoặc lâu dài và đưa ra các bước/hành động cần thiết để phù hợp với từng điều kiện, hoàn cảnh.- Chịu trách nhiệm nhập hàng, thực hiện đúng quy trình nhập hàng, vào sổ sách theo dõi kho hàng. Đối với những trường hợp nhập hàng ngoài khung giờ làm việc phải sắp xếp nhân sự nhập hàng để đảm bảo tính an toàn và đủ hàng hóa cho cửa hàng hoạt động. Kiểm soát số lượng nhập, xuất, tồn kho xăng, dầu của Cửa hàng Lê Văn Lương.3. Nhiệm vụ khác- Kết hợp với Ban An Ninh đảm bảo về công tác phòng chống cháy nổ, an toàn lao động, an ninh trật tự cho Cửa hàng Lê Văn Lương.- Kết hợp với Phòng TCHCNS & QT thực hiện công tác đào tạo đột xuất hoặc định kỳ.- Truyền thông cho CBNV Phòng KD XD về các thông báo, quy định của Công ty.", "Require": "- Có kinh nghiệm và có kinh nghiệm về lĩnh vực xăng dầu là một lợi thế.-Am hiểu các điều luật liên quan đến Môi trường, PCCC và các quy định về xăng dầu của nhà nước.- Nắm vững các quy trình làm việc hoạt động kinh doanh xăng dầu là một lợi thế"},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-truyen-thong-pa-marketing.35BF8D52.html", "Position": "Nhân viên truyền thông (PA marketing)", "Location": "Hà Nội", "Salary": "8 Tr - 11 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "", "Require": ""},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-digital-marketing.35BF8C23.html", "Position": "Nhân viên Digital Marketing", "Location": "Hà Nội", "Salary": "9 Tr - 15 Tr VND", "DeadlineSummit": "31/03/2024", "Detail": "- Nghiên cứu đối thủ cạnh tranh: Nghiên cứu các bài quảng cáo, các dạng quảng cáo mà đối thủ cạnh tranh đang triển khai và tham khảo thêm của các trung tâm ngoại ngữ khác (tiếng Anh, tiếng Nhật, tiếng Hàn)- Nghiên cứu khách hàng: Dựa vào thời điểm từng tháng, nắm bắt nhu cầu khách hàng thông qua các thông tin thi HSK, thi THPT, các dự đoán về nhu cầu đăng ký khoá học của bộ phận kinh doanh… phục vụ cho việc lên kế hoạch digital của tháng.- Lập kế hoạch chạy quảng cáo theo tháng phù hợp với mục tiêu doanh thu và data mà trưởng phòng đã phân bổ, đồng thời phù hợp với chiến dịch marketing của công ty, bao gồm:- Lập kế hoạch các bài chạy quảng cáo trong tháng bao gồm:- Check & chỉnh sửa content, ảnh phù hợp với chính sách quảng cáo của từng kênh quảng cáo.- Triển khai các chiến dịch quảng cáo trên các kênh chạy quảng cáo theo kế hoạch đã được trưởng phòng duyệt, đảm bảo target đúng đối tượng khách hàng tiềm năng.- Theo dõi, thống kê đo lường và phân tích số liệu và đưa ra các phương án để tối ưu ngân sách quảng cáo, tỷ lệ chuyển đổi của các chiến dịch quảng cáo.- Theo dõi quá trình chi tiêu, tổng hợp các hoá đơn thanh toán từ các kênh quảng cáo (Facebook, Zalo OA, Tiktok) và tiến hành làm đề xuất thanh toán thẻ tín dụng khi hết ngưỡng chi tiêu để bộ phận kế toán, trưởng phòng, BGĐ xét duyệt.- Quản lý tài nguyên: Tài khoản quảng cáo, fanpage, BM. Back up kịp thời các tài nguyên liên quan quảng cáo khi có sự cố.- Thực hiện báo cáo kết quả quảng cáo theo tuần, tháng.​ Số lượng data khách hàng mang về/tháng , Chi phí quảng cáo / tháng", "Require": "- Có 2 năm kinh nghiệm Digital Marketing.- Phân tích, tổng hợp dữ liệu- Có hiểu biết về Marketing, Advertising, Media, PR, Event- Thành thạo công cụ Digital Marketing- Tốt nghiệp ngành Marketing hoặc truyền thông, báo chí"},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-kinh-doanh-mien-nam.35BF8C97.html", "Position": "Nhân Viên Kinh Doanh- Miền Nam", "Location": "Hồ Chí Minh", "Salary": "Cạnh tranh", "DeadlineSummit": "31/03/2024", "Detail": "1. Tìm kiếm khách hàng mới, chăm sóc khách hàng sẵn có.2. Triển khai các kế hoạch bán hàng tại khu vực được giao.3. Đảm bảo mục tiêu doanh số tại địa bàn phụ trách.4. Thực hiện báo cáo theo quy định của công ty.", "Require": ""},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/ky-su-thi-cong-he-thong-dien.35BF8BCE.html", "Position": "Kỹ sư Thi công hệ thống điện", "Location": "Hà Nội", "Salary": "14 Tr - 25 Tr VND", "DeadlineSummit": "17/03/2024", "Detail": "- Tham gia triển khai bản vẽ shop, bóc tách khối lượng đề xuất vật tư, thiết bị thi công của hệ thống điện động lực, điện điều khiển.- Tính toán khối lượng, kiểm soát chất lượng các hạng mục thi công đảm bảo đúng thiết kế và theo hồ sơ thầu.- Lập hồ sơ chất lượng các hạng mục thi công, bản vẽ hoàn công.- Phối hợp với các bộ phận có liên quan triển khai thực hiện dự án.- Thực hiện các công việc khác theo sự phân công của Công ty/ Trưởng bộ phận", "Require": "- Có ít nhất 5 năm kinh nghiệm và có khả năng đáp ứng các yêu cầu theo mô tả nêu trên.- Tốt nghiệp đại học chuyên ngành: điện dân dụng & công nghiệp, điện tự động, thiết bị điện, nhiệt, cấp thoát nước, PCCC & các hệ thống công nghệ khác.- Kỹ năng quản lý, xử lý và giám sát công việc tốt.- Cẩn thận, trung thực và có khả năng giao tiếp, phối hợp và làm việc nhóm.- Có sức khỏe tốt, có thể làm việc ngoài giờ theo yêu cầu của công ty.- Sẵn sàng đi dự án xa nếu cần thiết.- Ưu tiên ứng viên có kinh nghiệm về thiết kế điện cấp nguồn, điện điều khiển cho hệ thống PCCC."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/ky-su-thiet-ke-he-thong-dien.35BF8BD1.html", "Position": "Kỹ sư Thiết kế hệ thống điện", "Location": "Hà Nội", "Salary": "14 Tr - 25 Tr VND", "DeadlineSummit": "17/03/2024", "Detail": "- Thiết kế, bóc tách khối lượng và lên báo giá hệ thống điện công trình bao gồm: Trạm biến áp, máy phát điện, cấp nguồn động lực, tủ điện, điều khiển, chiếu sáng, báo cháy, điện thoại, loa, chống sét.- Tham gia thiết kế các giai đoạn của dự án, từ thiết kế ý tưởng đến thiết kế cơ sở, thiết kế kỹ thuật, kỹ thuật thi công, giám sát tác giả- Triển khai và hoàn thiện hồ sơ thiết kế từng giai đoạn theo quy định gồm: bảng tính, thuyết minh, bản vẽ, thống kê vật tư, thiết bị chính, chỉ dẫn kỹ thuật, quy trình bảo trì.- Phối hợp với các bộ môn khác (kiến trúc, kết cấu, Cấp thoát nước, Điều hòa thông gió, PCCC, ...) để tối ưu hóa phương án thiết kế- Phối hợp với khách hàng và các đơn vị thiết kế khác hoặc thầu phụ để cập nhật, sữa chữa hồ sơ thiết kế theo ý kiến của chủ đầu tư, đơn vị vận hành và các cơ quan chức năng.- Phối hợp xử lý các vấn đề kỹ thuật vướng mắc trong quá trình giám sát tác giả- Thường xuyên cập nhật các quy chuẩn VN, tiêu chuẩn VN, tiêu chuẩn nước ngoài (nếu có) về hệ thống điện, điện nhẹ.- Phối hợp với các hãng cung cấp thiết bị, giải pháp để cập nhật công nghệ, cập nhật thiết kế.- Thực hiện các công việc khác theo sự phân công của Công ty/ Trưởng bộ phận", "Require": "- Có ít nhất 5 năm kinh nghiệm và có khả năng đáp ứng các yêu cầu theo mô tả nêu trên.- Tốt nghiệp đại học chuyên ngành: điện dân dụng & công nghiệp, điện tự động, thiết bị điện, nhiệt, cấp thoát nước, PCCC & các hệ thống công nghệ khác.- Kỹ năng quản lý, xử lý và giám sát công việc tốt.- Cẩn thận, trung thực và có khả năng giao tiếp, phối hợp và làm việc nhóm.- Có sức khỏe tốt, có thể làm việc ngoài giờ theo yêu cầu của công ty.- Sẵn sàng đi dự án xa nếu cần thiết.- Ưu tiên ứng viên có kinh nghiệm về thiết kế điện cấp nguồn, điện điều khiển cho hệ thống PCCC."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-kinh-doanh-mien-bac.35BF8C91.html", "Position": "Nhân Viên Kinh Doanh- Miền Bắc", "Location": "Hà Nội", "Salary": "Cạnh tranh", "DeadlineSummit": "31/03/2024", "Detail": "1. Tìm kiếm khách hàng mới, chăm sóc khách hàng sẵn có.2. Triển khai các kế hoạch bán hàng tại khu vực được giao.3. Đảm bảo mục tiêu doanh số tại địa bàn phụ trách.4. Thực hiện báo cáo theo quy định của công ty.", "Require": ""},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/ky-su-thiet-ke-ban-ve-he-thong-pccc-hut-khoi.35BF8BD5.html", "Position": "Kỹ sư Thiết kế bản vẽ hệ thống PCCC/Hút khói", "Location": "Hà Nội", "Salary": "8 Tr - 20 Tr VND", "DeadlineSummit": "17/03/2024", "Detail": "- Tư vấn quy chuẩn, tiêu chuẩn, thiết kế PCCC, hút khói các dự án nhà công nghiệp- Nghiên cứu, thiết kế bản vẽ hệ thống PCCC/ Hút khói theo yêu cầu và ý tưởng của khách hàng và BGĐ Công ty- Thiết kế, lên phối cảnh triển khai chi tiết kỹ thuật thi công công trình- Bóc tách chủng loại vật tư, khối lượng, vật liệu… theo hồ sơ thiết kế đã được phê duyệt.- Thực hiện các nhiệm vụ khác thuộc chuyên môn do lãnh đạo phòng phân công.", "Require": "- Ưu tiên có kinh nghiệm tư vấn quy chuẩn, tiêu chuẩn, thiết kế PCCC, hút khói, bóc tách khối lượng...- Am hiểu tiêu chuẩn, quy chuẩn về chuyên ngành PCCC.- Biết sử dụng thành thạo phần mềm thiết kế PCCC, Tin học văn phòng.- Nhanh nhẹn, làm việc có trách nhiệm.- Đam mê công việc, có định hướng gắn bó lâu dài với Công ty."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/nhan-vien-content-marketing.35BEF09E.html", "Position": "Nhân Viên Content Marketing", "Location": "Hà Nội", "Salary": "9 Tr - 11 Tr VND", "DeadlineSummit": "15/03/2024", "Detail": "", "Require": ""},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/digital-marketing.35BF8C8A.html", "Position": "Digital Marketing", "Location": "Hà Nội", "Salary": "11 Tr - 15 Tr VND", "DeadlineSummit": "31/03/2024", "Detail": "• Triển khai và tối ưu hóa quảng cáo trên các kênh Online: Google, Facebook và các kênh Digital khác (Tiktok, Instagram,…) để quảng bá thương hiệu và tăng doanh số bán hàng các sản phẩm của công ty.• Thống kê, phân tích các số liệu quảng cáo để có các điều chỉnh hợp lý, tăng hiệu quả quảng cáo trực tiếp: Tăng Lead hoặc Giảm chi phí/Lead.• Triển khai hoạt động SEO (Search Engine Optimization), SEM (Search Engine Marketing), Google Adwords tối ưu hóa thứ hạng của Website công ty trên các trang tìm kiếm.• Triển khai quảng bá qua Email Marketing và Mobile Marketing.• Phối hợp với quản lý sản phẩm, thiết kế và kinh doanh… để thực hiện các chiến dịch digital marketing.• Báo cáo hiệu quả marketing trên các kênh truyền thông số theo tháng hoặc theo chiến dịch", "Require": "- Tốt nghiệp cao đẳng trở lên chuyên ngành công nghệ thông tin, marketing số, … hoặc các chuyên ngành liên quan- 2 năm kinh nghiệm vị trí tương đương, ưu tiên ứng viên có kinh nghiệm trong lĩnh vực bán lẻ, FMCG- Có kiến thức về internet, online, các trang web, ranking, alexa, google, facebook…- Am hiểu về SEO, SEM, Directory submit, URL submit, Forum, mạng xã hội, các trang web mua bán…và thường xuyên chơi trên các mạng xã hội, forum."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/quan-doc-ga-ra-oto-tt-cham-soc-xe-hoi.35BF8D09.html", "Position": "Quản đốc Ga ra ôtô (TT Chăm sóc xe hơi)", "Location": "Hà Nội", "Salary": "15 Tr - 20 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "- Quản lý và tổ chức toàn bộ công việc liên quan đến Kinh doanh Phát triển doanh số và Quan hệ khách hàng để đạt được mục tiêu chiến lược của Công ty- Lập kế hoạch, tổ chức thực hiện và giám sát việc triển khai kế hoạch kinh doanh của Gara/ Trung tâm chăm sóc xe hơi theo tháng, quý, năm.- Xây dựng chính sách giá/ kinh doanh, ngân sách kinh doanh cho các kế hoạch ngắn, trung và dài hạn; triển khai và kiểm soát việc thực hiện.- Nghiên cứu và phát triển thị trường mới, xây dựng mối quan hệ chặt chẽ với khách hàng/ đối tác để xây dựng thị trường tiềm năng và tạo ra các cơ hội kinh doanh phù hợp với mục đích tăng trưởng doanh thu cho công ty- Quản lý các hoạt động thợ tại gara và tổ đội sửa chữa...đảm bảo tuân thủ đúng theo quy định công việc và của Công ty và Luật pháp Việt Nam.- Chỉ đạo xử lý giải đáp những thắc mắc của khách hàng liên quan đến Ga ra và các hoạt động kinh doanh tại TTCSXH của Công ty.- Kiểm soát quá trình đàm phán, ký HĐ, kiểm soát các điều khoản trên HĐ để đảm bảo các yếu tố về giá trị, tài sản, pháp lý khi ký kết với Khách hàng, đối tác.- Chăm sóc duy trì khách hàng hiện hữu và có khả năng mở rộng tìm kiếm khách hàng mới.- Giám sát các chi phí hoạt động và Ngân Sách chi tiêu của Phòng, điều phối các dự án cải thiện năng suất làm việc để thúc đẩy hoạt động kinh doanh của Phòng.- Quản lý nhập hàng đúng quy trình nhập hàng, sắp xếp nhân sự, tổ thợ... nhập hàng để đảm bảo tính an toàn và đủ hàng hóa cho cửa hàng hoạt động. Kiểm soát số lượng nhập, xuất, tồn", "Require": "- Có kinh nghiệm về Xe và hoặt động Chăm sóc xe hơi là một lợi thế.- Am hiểu các điều luật liên quan đến Môi trường, PCCC và các quy định về xăng dầu của nhà nước.- Am hiểu công tác quản lý Ga ra sửa chữa ô tô/xe phân khối lớn- Có kiến thức về lĩnh vực hoạt động sản xuất kinh doanh của Công ty.- Nắm vững các quy trình làm việc hoạt động kinh doanh TTCSXH-Có kinh nghiệm trong quản lý kinh doanh/quản đốc.."},
{"Link": "https://careerviet.vn/vi/tim-viec-lam/pho-gd-kinh-doanh-tt-cham-soc-xe-hoi.35BF8D0A.html", "Position": "Phó GĐ kinh doanh TT Chăm sóc xe hơi", "Location": "Hà Nội", "Salary": "15 Tr - 20 Tr VND", "DeadlineSummit": "16/03/2024", "Detail": "- Quản lý và tổ chức toàn bộ công việc liên quan đến Kinh doanh Phát triển doanh số và Quan hệ khách hàng để đạt được mục tiêu chiến lược của Công ty- Lập kế hoạch, tổ chức thực hiện và giám sát việc triển khai kế hoạch kinh doanh của Gara/ Trung tâm chăm sóc xe hơi theo tháng, quý, năm.- Tổ chức thu thập, phân tích, đánh giá thông tin thị trường, đối thủ cạnh tranh và đưa ra đề xuất, kiến nghị thay đổi kế hoạch kinh doanh cho phù hợp với từng thời điểm.- Xây dựng chính sách giá/ kinh doanh, ngân sách kinh doanh cho các kế hoạch ngắn, trung và dài hạn; triển khai và kiểm soát việc thực hiện.- Nghiên cứu và phát triển thị trường mới, xây dựng mối quan hệ chặt chẽ với khách hàng/ đối tác để xây dựng thị trường tiềm năng và tạo ra các cơ hội kinh doanh phù hợp với mục đích tăng trưởng doanh thu cho công ty- Quản lý các hoạt động thợ tại gara và tổ đội sửa chữa...đảm bảo tuân thủ đúng theo quy định công việc và của Công ty và Luật pháp Việt Nam.- Chỉ đạo xử lý giải đáp những thắc mắc của khách hàng liên quan đến Ga ra và các hoạt động kinh doanh tại TTCSXH của Công ty.- Kết hợp với Phòng Marketing trong công tác truyền thông, quảng bá thương hiệu và trong các chiến dịch kinh doanh của Công ty; triển khai chăm sóc khách hàng, đưa ra những đề xuất tri ân khách hàng hợp lý để tăng doanh thu, lợi nhuận cho Công ty.- Tổng kết lại những kết quả và chỉ tiêu kinh doanh theo từng tháng để từ đó xem xét và đánh giá chất lượng sản phẩm/dịch vụ của từng Phòng kinh doanh, đưa ra những phương án kinh doanh tối ưu nhất cho từng Phòng.- Kiểm soát quá trình đàm phán, ký HĐ, kiểm soát các điều khoản trên HĐ để đảm bảo các yếu tố về giá trị, tài sản, pháp lý khi ký kết với Khách hàng, đối tác.- Chăm sóc duy trì khách hàng hiện hữu và có khả năng mở rộng tìm kiếm khách hàng mới.- Tổ chức các chương trình huấn luyện và hướng dẫn thực hành cho các KTV nhằm nâng cao trình độ và tay nghề.- Thực hiện nhiệm vụ công việc khác có liên quan theo sự phân công của BLĐ.- Giám sát các chi phí hoạt động và Ngân Sách chi tiêu của Phòng, điều phối các dự án cải thiện năng suất làm việc để thúc đẩy hoạt động kinh doanh của Phòng.- Quản lý nhập hàng đúng quy trình nhập hàng, sắp xếp nhân sự, tổ thợ... nhập hàng để đảm bảo tính an toàn và đủ hàng hóa cho cửa hàng hoạt động. Kiểm soát số lượng nhập, xuất, tồn", "Require": "- Có kinh nghiệm về Xe và hoặt động Chăm sóc xe hơi là một lợi thế.- Am hiểu các điều luật liên quan đến Môi trường, PCCC và các quy định về xăng dầu của nhà nước.- Am hiểu công tác quản lý Ga ra sửa chữa ô tô/xe phân khối lớn- Có kiến thức về lĩnh vực hoạt động sản xuất kinh doanh của Công ty.- Nắm vững các quy trình làm việc hoạt động kinh doanh TTCSXH-Có kinh nghiệm trong quản lý kinh doanh/quản đốc.."}
]